[
    {
        "chat_name": "Welcome",
        "text": "Hello world. I'm not a robot. But I like snow.",
        "user": "Fexjo"
    },
    {
        "chat_name": "Daily thoughts about Daily Thoughts",
        "text": "Hello world. I count like ! !! !!.",
        "user": "Robot1311213"
    },
    {
        "chat_name": "Simply a poem?",
        "text": "Anyone else found Robot1311213's poem strange? I'm thinking it might mean something else. I smell a puzzle brewing!",
        "user": "icniVad"
    },
    {
        "text": "I concur. It is a most peculiar poem. We should initialize an investigation immediately.",
        "user": "Mr X"
    },
    {
        "text": "Righto. But where to start? I tried looking for hidden letters and stuff but couldn't find anything. No letters seem odd either.",
        "user": "icniVad"
    },
    {
        "text": "If there is nothing hidden, it is simply in plain sight. I shall procced with this thought in mind.",
        "user": "Mr X"
    },
    {
        "text": "This text is all over the place, I can't make sense of it at all. Pleasant temperature, but that's not how he likes it? What's up with the guy? I think he needs to repair his temp-sensors or something.",
        "user": "icniVad"
    },
    {
        "text": "Do calm down. I believe we should not interpret this as meaning something on the whole. Maybe we should take it apart into pieces?",
        "user": "Mr X"
    },
    {
        "text": "Pieces ey? Alright, let's start with this place he talks about. Where has he been recently? Maybe some of his other posts will  shed some light on this.",
        "user": "icniVad"
    },
    {
        "text": "I believe he visited 'Universeum' the other day. I found this website of theirs which contain more information https://www.universeum.se/en/",
        "user": "Mr X"
    },
    {
        "text": "Interesting, very interesting. I see they have a restaurant and cafe. He did mention drinks and simple foodstuff. I'm thinking we're onto something here. You remember how Fexjo's avatar is a salad? They even made a post about it earlier. It's all coming back to me now, and it's all connected! They seem to have reused the good ol' ceasar cipher.",
        "user": "icniVad"
    },
    {
        "text": "Whatever do you mean? I do not follow your train of thought. Please elaborate",
        "user": "Mr X"
    },
    {
        "text": "In addition, it is 'Caesar'. Not 'Ceasar'.",
        "user": "Mr X"
    },
    {
        "text": "Don't you see? Food, salad, caesar cipher, it's all part of a larger scheme! They must have planned this for ages. Now, get this, he included that the place had food and drink available right? And what food have we seen before in a post? That's right! Salad! And don't you remember where that lead us? That was a ceasar cipher for Fexjo's name! This must be something similar! Now we just got to figure out how we use the caesar cipher for this poem. If it's just a part of the puzzle or if this will lead us down another path of clues. Man i'm excited!!",
        "user": "icniVad"
    },
    {
        "text": "Oh yeah, Caesar*, my bad.",
        "user": "icniVad"
    },
    {
        "text": "I understand your speculation. What do you suppose is the word to decrypt with the cipher? I have found no such clue and wonder if this is the correct path to take.",
        "user": "Mr X"
    },
    {
        "text": "Shouldn't it be like, victory? That's the final word of the poem and what seems to be the conclusion of the entire experience.",
        "user": "icniVad"
    },
    {
        "text": "The more I think about this the more it makes sense! Continuous humming sound? Bunch of people talking in a restaurant! Particular variety? The food he's eating! It's all coming back to the salad!",
        "user": "icniVad"
    },
    {
        "text": "Hey, you there? Come on, you gotta help me on this, we're so close! If we just figure this out I know we're gonna find something interesting.",
        "user": "icniVad"
    },
    {
        "text": "You can't just leave me hanging like this.",
        "user": "icniVad"
    },
    {
        "text": "Earth to X?",
        "user": "icniVad"
    },
    {
        "text": "Anyone alive?",
        "user": "icniVad"
    },
    {
        "text": "Ah, I see. The salad got to you. A classic case of overeating.",
        "user": "icniVad"
    },
    {
        "text": "No, that is obviously a flawed conclusion. I was simply otherwise occupied. However, I have considered this problem during the day and firmly believe that the salad is not relevant. Instead, I am attempting to find another angle to this problem.",
        "user": "Mr X"
    },
    {
        "text": "Let's agree to disagree then. As you said, we'll divide up the work. I'll continue on the salad clue and you can work out something else. Maybe the first part? Seems to me that the salad is mostly focused on in the second half of the poem.",
        "user": "icniVad"
    },
    {
        "text": "That is acceptable. I shall follow your suggestion for the moment.",
        "user": "Mr X"
    },
    {
        "text": "Or wait… Maybe the salad is an object in the first half and the second half is about where you buy the salad! Now we get back to universum or whatever it was called. It's probably also involved in some way.",
        "user": "icniVad"
    },
    {
        "text": "Scarcely a moment ago, we agreed to divide the work and now you wish to work together again? Be that as it may, I have found another direction I believe the soluion of this puzzle is located in.",
        "user": "Mr X"
    },
    {
        "text": "Yeah? Please share, any clue is a good clue.",
        "user": "icniVad"
    },
    {
        "text": "Definitions and synonyms may be highly relevant. Do yo not think that a mistake is an error and a victory is the same as a win?",
        "user": "Mr X"
    },
    {
        "text": "Pretty smart, like how The process of gaining this could be Experience? Now just to figure out how this relates to the salad…",
        "user": "icniVad"
    },
    {
        "text": "Your fixation on the salad is incomprehensible.",
        "user": "Mr X"
    },
    {
        "text": "In any case, I believe 'a particular variety or type' is kind, sort or race.",
        "user": "Mr X"
    },
    {
        "text": "I'm telling you, it's all connected, it has to be!",
        "user": "icniVad"
    },
    {
        "text": "But continuing on that track, standard that seems perfect is probably Ideal. And Pleasant temperature is probably Temperate or Comfortable or Warm or something similar. Actually the more I think about it the more options it could be. It'll be a pain to nail down one answer to each of these.",
        "user": "icniVad"
    },
    {
        "text": "Your attitude needs adjusmtents. It is not 'a pain', but a challenge. I am going to undertake this test and return triumphant. Farewell.",
        "user": "Mr X"
    },
    {
        "text": "Wait, seriously? You're just leaving me in the dust? And here I thought we were doing this together.",
        "user": "icniVad"
    },
    {
        "text": "Okay, I can do this. Let's just review what words have already been deciphered and see if there's some pattern. Win, Error, Ideal, (Kind, Sort, Race), (Temperate, Comfortable, Warm). Hmm.. Win and Error, definitely reminds me of Windows. Ideal could also be along those tracks what with not having errors. Sort is probably it. Not sure about the last one but at the same time a bunch of words are missing so maybe they will shed some light on things. But again, what would windows have to do with a salad? This is convoluted to the extreme but I always knew Robot1311213 was a secret mastermind.",
        "user": "icniVad"
    },
    {
        "text": "Hello! See youre working on puzzles as always. Are you close?",
        "user": "Tree123"
    },
    {
        "text": "Extremely so. This is the most advanced puzzle yet but I believe it'll be cracked in mere moments. Now I just need to figure out the salad. Any thoughts mr Tree?",
        "user": "icniVad"
    },
    {
        "text": "It is Ms Tree. But amazing! Are you sure the salad is relevant? Wasnt that a clue for the old puzzle?",
        "user": "Tree123"
    },
    {
        "text": "Exactly! A good puzzle draws on ambient environments and what better way to increase interest and complexity of a puzzle but to use what is already available on the website. Not only does it simplify the work put into the puzzle but it also brings out relevance and keeps the interest of the participants. Quite a classic trick but one that works quite well. I've seen it done many times before.",
        "user": "icniVad"
    },
    {
        "text": "Well. That sounds reasonable. I dont think Ill be able to help",
        "user": "Tree123"
    },
    {
        "text": "I'll keep you updated on my progress.",
        "user": "icniVad"
    },
    {
        "text": "Thanks! Gotta go, so good luck!",
        "user": "Tree123"
    },
    {
        "text": "cakew",
        "user": "Mr X"
    },
    {
        "text": "Wait, what?",
        "user": "icniVad"
    },
    {
        "text": "It is the answer.",
        "user": "Mr X"
    },
    {
        "text": "Woah there, slow down. How the heck did you reach that conclusion? It's nowhere close to where I'm at!",
        "user": "icniVad"
    },
    {
        "text": "It is simply because I am not obsessed with the salad that I arrived at this outcome faster.",
        "user": "Mr X"
    },
    {
        "text": "Alright whatever. Please explain your reasoning. I wanna hear how you figured this one out. If it's even the answer, which I doubt.",
        "user": "icniVad"
    },
    {
        "text": "Congratulations Mr X, you figured it out. I'll send you your reward in a dm.",
        "user": "Robot1311213"
    },
    {
        "text": "Thank you, Robot. You have been refuted, Mr DaVinci",
        "user": "Mr X"
    },
    {
        "text": "Woah, wait. You were right? And a reward as well? Now I'm jealous. Come on, tell me how you solved it. I'm dying of curiosity right now.",
        "user": "icniVad"
    },
    {
        "text": "Actually, before that, lemme try something.",
        "user": "icniVad"
    },
    {
        "text": "SaladW.",
        "user": "icniVad"
    },
    {
        "text": "No? Nothing? Oh well it was worth a try.",
        "user": "icniVad"
    },
    {
        "text": "You need to develop your patience, Mr DaVinci. As such, I will tell you the process tomorrow.",
        "user": "Mr X"
    },
    {
        "text": "Tomorrow? wait wait wait. Come on man, don't do this to me. I can't wait that long, this is my life's work man, I've been at this for at least a couple of days you know!",
        "user": "icniVad"
    },
    {
        "text": "Okay it's now tomorrow. Explain now please.",
        "user": "icniVad"
    },
    {
        "text": "It follows the pattern that we agreed on previously. To solve this puzzle, it is necessary to replace each line with another word. So, in order from top to bottom:",
        "user": "Mr X"
    },
    {
        "text": "Warm",
        "user": "Mr X"
    },
    {
        "text": "Reality",
        "user": "Mr X"
    },
    {
        "text": "Ideal!",
        "user": "icniVad"
    },
    {
        "text": "Ideal",
        "user": "Mr X"
    },
    {
        "text": "Tight",
        "user": "Mr X"
    },
    {
        "text": "Error",
        "user": "Mr X"
    },
    {
        "text": "Cafe",
        "user": "Mr X"
    },
    {
        "text": "Restaurant.",
        "user": "icniVad"
    },
    {
        "text": "Wait I meant cafe.",
        "user": "icniVad"
    },
    {
        "text": "Abuzz",
        "user": "Mr X"
    },
    {
        "text": "Of course you did. Continuing on:",
        "user": "Mr X"
    },
    {
        "text": "Kind",
        "user": "Mr X"
    },
    {
        "text": "Experience and then win.",
        "user": "icniVad"
    },
    {
        "text": "That is correct.",
        "user": "Mr X"
    },
    {
        "text": "Then simply follow these instrutions.",
        "user": "Mr X"
    },
    {
        "text": "Okay. Warm, Reality, Ideal, Tight, Error, Cafe, Abuzz, Kind, Experience, Win. Seems simple enough to me, first letter of each gives me 'write cakew'.",
        "user": "icniVad"
    },
    {
        "text": "But I also know that this has a second part, and probably a second reward for that as well.",
        "user": "icniVad"
    },
    {
        "text": "I assume you will mention the salad next.",
        "user": "Mr X"
    },
    {
        "text": "It's something to do with the salad. I'm telling you.",
        "user": "icniVad"
    },
    {
        "text": "So what did you get?",
        "user": "icniVad"
    },
    {
        "text": "Three recipes. Both Fexjo's and Robot's favorite cakes were included. Although I find myself reluctant to admit this, the last recipe was of a salad.",
        "user": "Mr X"
    },
    {
        "text": "AHA! Told you it was relevant.",
        "user": "icniVad"
    },
    {
        "text": "Well that's that then. It was fun while it lasted. Can't wait for the next one.",
        "user": "icniVad"
    },
    {
        "text": "For your participation and enthusiasm you will get the salad recipe as well icniVad.",
        "user": "Robot1311213"
    },
    {
        "text": "Heck yeah, that's awesome.",
        "user": "icniVad"
    },
    {
        "text": "I see you have solve it. Amazing!",
        "user": "Tree123"
    },
    {
        "text": "I completely agree with your assesment of my intellectual capabilites.",
        "user": "Mr X"
    },
    {
        "text": "I'll get the next one though, trust me on this.",
        "user": "icniVad"
    },
    {
        "chat_name": "Usernames?",
        "text": "Hey, so, I'm guessing you all saw the post about the usernames as well right? Didn't realize they had a deeper meaning but I'm always up for a challenge. Anyone interested in figuring it out with me?",
        "user": "icniVad"
    },
    {
        "text": "Fexjo was hinted at with a salad so that could be an avenue to go down. But I kinda wanna start with Robot. I'm thinking the numbers are what's up, might be some letter to number converter or something similar there.",
        "user": "icniVad"
    },
    {
        "text": "Hello! I've never talked with you before or done many puzzles but let's try! Can it be the number of a machine? They have article numbers right?",
        "user": "Tree123"
    },
    {
        "text": "Machine article numbers you say? Interesting approach. Then what machines are we talking? We know he's a robot but not what kind. If we could find his model then we could probably find some details on article numbers and the like.",
        "user": "icniVad"
    },
    {
        "text": "That's true. But it is only a cute drawn avatar. Is it really possible to find out?",
        "user": "Tree123"
    },
    {
        "text": "Hmm, good point. Maybe there's something hidden in the image? I'll try to run it through some image processing software and see if I can get some info.",
        "user": "icniVad"
    },
    {
        "text": "I don't know anything about that so I can't really help. Good luck!",
        "user": "Tree123"
    },
    {
        "text": "No dice i'm afraid. Looks like a normal image. No hidden info there. I ran the salad pic as well just to be sure.",
        "user": "icniVad"
    },
    {
        "text": "Maybe it's time to go back to the basics. I'm loath to admit it but I'm known to overcomplicate matters.",
        "user": "icniVad"
    },
    {
        "text": "Too bad. What salad do you think it is anyway? Looks tasty.",
        "user": "Tree123"
    },
    {
        "text": "Don't really know much about salads. Seems to be some sort of bacon salad?",
        "user": "icniVad"
    },
    {
        "text": "For the numbers I'm thinking we'll just start on some easy feet. How about the alphabet? 1 is A and 2 is B and so on.",
        "user": "icniVad"
    },
    {
        "text": "Can't really see more than bacon. What are those round things? But back to the robot I guess",
        "user": "Tree123"
    },
    {
        "text": "1311213 would be ACAABAC.",
        "user": "icniVad"
    },
    {
        "text": "That does not really work. Maybe it starts with 13? That would be M right?",
        "user": "Tree123"
    },
    {
        "text": "Or maybe they're separate numbers and it's like 1 31 12 1 3 or something.",
        "user": "icniVad"
    },
    {
        "text": "Ah, you're on to something.",
        "user": "icniVad"
    },
    {
        "text": "MKUC?",
        "user": "icniVad"
    },
    {
        "text": "Doesn't sound right.",
        "user": "icniVad"
    },
    {
        "text": "What if we group them another way? We don't know which number is the loner, so maybe we should try other combinations as well. Let me see... MALM or MKBM I guess? Doesn't really make sense either.",
        "user": "Tree123"
    },
    {
        "text": "He's from Gothenburg right? Says so in the About page. Maybe it's his last name and his first name is Robot?",
        "user": "icniVad"
    },
    {
        "text": "Some quick googling shows that Malm is a relatively common Swedish last name.",
        "user": "icniVad"
    },
    {
        "text": "Well. I know Fexji from being am exchange student together, but noone was called robot",
        "user": "Tree123"
    },
    {
        "text": "Fexjo*",
        "user": "Tree123"
    },
    {
        "text": "Might be he just didn't want to share his first name then. I think we're basically done here. Might be time to move on to the salad.",
        "user": "icniVad"
    },
    {
        "text": "Then let's go back to figuring out what type it is. What salads do you know?",
        "user": "Tree123"
    },
    {
        "text": "As said, not a lot. But we saw bacon and maybe some crusty bread or something right? I googled that and got Panzanella. Which apparently is a kind of salad with wet bread. Doesn't match the image though so I think that's a bust.",
        "user": "icniVad"
    },
    {
        "text": "Decided to be smart and do an image search instead. It's a Caesar salad. Should have done that first smh.",
        "user": "icniVad"
    },
    {
        "text": "Well, that's surprisingly ordinary. There's nothing special it contains so now we are a bit lost again. Or at least I am. Maybe the type was not relevant at all? Maybe we just need to know that it is a salad. Which is basically a mix of things.",
        "user": "Tree123"
    },
    {
        "text": "Should we try to blend the letters and move then around?",
        "user": "Tree123"
    },
    {
        "text": "Caesar, caesar, where have I heard that before? Hmm. Sure, we can move them around a bit. Fojex? Or maybe it's some word inside? Fox, Foe, maybe something like that?",
        "user": "icniVad"
    },
    {
        "text": "What else is there but 'et tu Brutus'. Anyway, I don't think his name is Fox or Foe. How would we even know when we find the right combination?",
        "user": "Tree123"
    },
    {
        "text": "Good question. Hmm. I know there's something about Caesar, it's just at the tip of my tongue but I can't quite remember.",
        "user": "icniVad"
    },
    {
        "text": "That's right! Caesar cipher! My god it's so obvious, how could I have forgotten. This is like the basic of basics of encoding. Okay, let's check the name through a Caesar cipher and see what we find.",
        "user": "icniVad"
    },
    {
        "text": "Through a quick brute force method I can confidently say that the only logical result is Edwin, ergo, that's his name.",
        "user": "icniVad"
    },
    {
        "text": "I'm amazing at this, I know. Hehehe. I'm looking forward to future puzzles like this. It was loads of fun.",
        "user": "icniVad"
    },
    {
        "text": "I also know that one! Caesar cipher is the one we're you shift letters right?",
        "user": "Tree123"
    },
    {
        "text": "Do you think we have figured out everything?",
        "user": "Tree123"
    },
    {
        "text": "Yes exactly. As for the solution, RobotMalm and Edwin seems like the extent we can figure out right now. Then again, we can't count our chickens before they catch. Let's wait and see if Robot or Fexjo deems the answer correct.",
        "user": "icniVad"
    },
    {
        "text": "Well, I actually now Fexjo's real name is Edwin. So I guess it is everything, but let's wait and see.",
        "user": "Tree123"
    },
    {
        "text": "Nice, seems we at least got that one right then.",
        "user": "icniVad"
    },
    {
        "text": "That's correct. Good job. As a reward, I'll tell you that my first name is Wilfred.",
        "user": "Robot1311213"
    },
    {
        "text": "Very nice! This was fun, I like the idea that some puzzles are included in the posts. Made the website more interactive in my opinion.",
        "user": "icniVad"
    },
    {
        "text": "I think its hard. But maybe I can help with discussions sometimes",
        "user": "Tree123"
    },
    {
        "text": "Happy to have company :)",
        "user": "icniVad"
    },
    {
        "text": "I see a puzzle has been solved. Unfortunately, I joined too late. I greatly anticipate the next one.",
        "user": "Mr X"
    },
    {
        "chat_name": "A new puzzle",
        "text": "This is obviously a puzzle. We should start examining this immediately!",
        "user": "Mr X"
    },
    {
        "text": "Let's go! Another one so soon. Any thoughts yet? These names are very interesting. Some famous people but also some that I don't quite recognise. Nothing a quick internet search can't fix.",
        "user": "icniVad"
    },
    {
        "text": "How can you not recognize most of them? This is clearly common knowledge.",
        "user": "Mr X"
    },
    {
        "text": "Hey. Don't be rude now X. <(￣ ﹌ ￣)>",
        "user": "Pinnipedia"
    },
    {
        "text": "Well, hello. I wish to clarify my statement. It was in no way to be rude, but simply to express my surprise at Da Vinci's ignorance.",
        "user": "Mr X"
    },    
    {
        "text": "How am I supposed to recognise some dude from the 1800s or a stand-up comedian? I guess we just had very different experiences growing up. Whatever, forget that! Let's focus on the puzzle itself. Any idea what to do with the numbers maybe?",
        "user": "icniVad"
    },    
    {
        "text": "All of them are different. Perhaps we could order the names by the numbers?",
        "user": "Mr X"
    },    
    {
        "text": "If it was just that then why have those specific numbers? The order would be Miller, Davis, Mandela, Roosevelt, Mead, Who, Rockefeller, Leno.",
        "user": "icniVad"
    },    
    {
        "text": "A valid question. It can not be the letter at a certain position either, as Jay Leno is less than 20 characters.",
        "user": "Mr X"
    },    
    {
        "text": "Maybe the number signifies something else? The number of children they have or something? That Leno guy must've gotten real frisky in that case.",
        "user": "icniVad"
    },    
    {
        "text": "Please keep your language civilized. Are you still present, Pinn? I believe you have vast knowledge of all matter of things. Do you know any way the numbers are related to each other?",
        "user": "Mr X"
    },    
    {
        "text": "I don't know what the numbers mean. But I recognise some of the names from the Quotes of the day page. Maybe that's relevant?",
        "user": "Pinnipedia" 
    },    
    {
        "text": "That is most probably a significant discovery. I will try to find the corresponding quotes.",
        "user": "Mr X"
    },    
    {
        "text": "The waiting is taking ages. I found the one by Mandela but then it disappeared before I even realised it. There are so many quotes too…",
        "user": "icniVad"
    },    
    {
        "text": "Huh? Simply keep refreshing the page and youll see all the nice quotes way faster.",
        "user": "DiggerTigger"
    },    
    {
        "text": "Wait, who are you? Regardless, thank you! This makes things so much easier. Now just to not refresh past the correct quotes…",
        "user": "icniVad"
    },    
    {
        "text": "Me? I'm simply the best person there is of course.",
        "user": "DiggerTigger"
    },    
    {
        "text": "Don't listen to my sister. She's  always full of it.",
        "user": "SpikeyTike"
    },    
    {
        "text": "Hey! You got the person wrong. That's not me, it's you!",
        "user": "DiggerTigger"
    },    
    {
        "text": "Uhuh, keep telling yourself that.",
        "user": "SpikeyTike"
    },    
    {
        "text": "Please continue your quibbling somewhere else. We were making continous progress before you showed up.",
        "user": "Mr X"
    },
    {
        "text": "I will because I'm right!",
        "user": "DiggerTigger"
    },
    {
        "text": " Sure sure. Whatever helps you sleep at night.",
        "user": "SpikeyTike"
    },
    {
        "text": "Moving on… The numbers, what do they mean? Is it the order of the quotes instead of the order of the people?",
        "user": "icniVad"
    },
    {
        "text": "But I can't sleep. Because of your loud music that is on even now! I'll go give you a piece of my mind.",
        "user": "DiggerTigger"
    },
    {
        "text": "I believe she has left. So we can continue thinking in peace.",
        "user": "Mr X"
    },
    {
        "text": "Wait a moment? Seriously? You're on your way? Shit, gotta go!",
        "user": "SpikeyTike"
    },
    {
        "text": "Okay, they're gone now. Let's get back to it.",
        "user": "icniVad"
    },
    {
        "text": "The order of the quotes you said. Have you found them all?",
        "user": "Mr X"
    },
    {
        "text": "I, myself, am still missing Dr Who's and Jay Leno's.",
        "user": "Mr X"
    },
    {
        "text": "I know, I know! They are Scientists are complaining that the new Dinosaur movie shows dinosaurs with lemurs, who didn't evolve for another million years. They're afraid the movie will give kids a mistaken impression. What about the fact that the dinosaurs are singing and dancing? and There's no point in being grown up if you can't be childish sometimes.",
        "user": "DiggerTigger"
    },
    {
        "text": "Didn't you go hunt down your brother?",
        "user": "icniVad"
    },
    {
        "text": "I was tricking him.",
        "user": "DiggerTigger"
    },
    {
        "text": "Ah! He's coming!",
        "user": "DiggerTigger"
    },
    {
        "text": "Bye!",
        "user": "DiggerTigger"
    },
    {
        "text": "Well, that was certainly something… Anyways, since you have the quotes can you figure out what the numbers have to do with them? What happens if you put them in order?",
        "user": "icniVad"
    },
    {
        "text": "I do not think that is correct, as the first couple of quotes becomes",
        "user": "Mr X"
    },
    {
        "text": "Dinosaurs may be extinct from the face of the planet, but they are alive and well in our imaginations. (Steve Miller)",
        "user": "Mr X"
    },
    {
        "text": "Everybody thinks it's going to be different for them.... The dinosaurs thought so too. (Davis)",
        "user": "Mr X"
    },
    {
        "text": "The greatest glory in living lies not in never falling, but in rising every time we fall. (Mandela)",
        "user": "Mr X"
    },
    {
        "text": "I have finally found Jay Leno's quote, as I wished to confirm DiggerTiggers statement. Have you acquired the last one?",
        "user": "Mr X"
    },
    {
        "text": "I found it! It's 'There's no point in being grown up if you can't be childish sometimes.'",
        "user": "Pinnipedia"
    },
    {     
        "text": "I'm sure I was just about to find it. When they're in order from what you just showed me could give something. The first letter of each quote turns into IDET. This could be a clue, maybe an acronym?",
        "user": "icniVad"
    },
    {
        "text": "Though of course we should include all the quotes mentioned.",
        "user": "icniVad"
    },
    {
        "text": "The first letters of all quotes in order is IDETATDS. It does not seem to tell us anything significant. Is it a cipher?",
        "user": "Mr X"
    },
    {
        "text": "Just a moment ago, I found something odd in our reasoning. How come we order them by number when the numbers are not sequential? Would it not be more obvious if they were 1, 2, in that case? But these are 1, 3, 7 and so on with no obvious pattern.",
        "user": "Mr X"
    },
    {
        "text": "Good point, what do you suggest it means? At first I thought it was prime numbers with the 1, 3, and 7 but then we have numbers like 12 which doesn't quite fit.",
        "user": "icniVad"
    },
    {
        "text": "I have inspected the numbers for any kind of mathematical sequence. However, I have found no such thing.",
        "user": "Mr X"
    },
    {
        "text": "Hmm. The numbers has to mean something, otherwise he wouldn't have included them. Maybe the numbers aren't a count between the quotes but instead within them? And that the order was right from the beginning. I can't help but notice the comma and exclamation mark as well. I didn't think of those before but they might indicate that the order is already fixed.",
        "user": "icniVad"
    },
    {
        "text": "We previously just used the first letter of every quote. Perhaps the number indicates which letter to use and, as you suggseted, the order is to remain the same.",
        "user": "Mr X"
    },
    {
        "text": "Makes sense to me. What does it give us?",
        "user": "icniVad"
    },
    {
        "text": "E A N E M D, N T!",
        "user": "Mr X"
    },
    {
        "text": "It certainly seems like I am doing all the work recently. Have you not gathered all the sayings yet?",
        "user": "Mr X"
    },
    {
        "text": "Well, I kinda stopped looking after all of them were found… Seemed like a lot of wasted effort you know. Anyways, those letters didn't give us much. Should we think of some other approach?",
        "user": "icniVad"
    },
    {
        "text": "What else is possible to count?",
        "user": "Mr X"
    },
    {
        "text": "Well, we've done characters, how about words or sentences?",
        "user": "icniVad"
    },
    {
        "text": "Certainly not sentences at least, as no quote has 20 of them. I will try words.",
        "user": "Mr X"
    },
    {
        "text": "Ah, that makes sense… Dunno what I was thinking.",
        "user": "icniVad"
    },
    {
        "text": "Do you believe 'it's' is one word, or two?",
        "user": "Mr X"
    },
    {
        "text": "Try both and see what we get maybe?",
        "user": "icniVad"
    },
    {
        "text": "I will do so later today, so either wait a moment or try it out yourself in the meantime.",
        "user": "Mr X"
    },
    {
        "text": "I'll be refreshing the quotes page a lot in the meantime then.",
        "user": "icniVad"
    },
    {
        "text": "As usual, your patience is limited. I must be going. Farewell, for now.",
        "user": "Mr X"
    },
    {
        "text": "Byebye, good luck.",
        "user": "icniVad"
    },
    {
        "text": "And now, the grind continues.",
        "user": "icniVad"
    },
    {
        "text": "'It's not childish to like dinosaurs, they're great!' I believe this to be the answer.",
        "user": "Mr X"
    },
    {
        "text": "Did someone say dinosaurs? I'm in!",
        "user": "Daemonosaurus"
    },
    {
        "text": "Seems good to me. Good work!",
        "user": "icniVad"
    },
    {
        "text": "I'm glad you agree with my statement. Dinosaurs are truly a mans best friend.",
        "user": "Robot1311213"
    },
    {
        "text": "Yes, you really get it! It's obviously not dogs, though I have to admit they have their own charm.",
        "user": "Daemonosaurus"
    },
    {
        "text": "Yet more people. I will once more take my leave and return when the next puzzle is found.",
        "user": "Mr X"
    },
    {
        "text": "You know what, me too. I'll see you when there's another puzzle.",
        "user": "icniVad"
    },
    {
        "text": "I would definitely have a small dinosaur instead of a dog if I could. Imagine a tiny planteating creature from a time long past. That would be a dream come true.",
        "user": "Robot1311213"
    },
    {
        "text": "Oh. My. God. That sounds so awesome!",
        "user": "Daemonosaurus"
    },
    {
        "text": "I know right?",
        "user": "Robot1311213"
    },
    {
        "text": "You know what creature I would love to have as a pet? A baby seal. They're so cute and cuddly and just plain adorable. Best thing is, they still exist. Maybe one day I'll get to have one. In the meantime zoo's will fulfill my heart.",
        "user": "Pinnipedia"
    },
    {
        "text": "Excuse me, everyone? This conversation is better done in another chat room. This also goes for DiggerTigger and SpikeyTike, as this room mainly seems to be for solving the puzzle.",
        "user": "Fexjo"
    },
    {
        "text": "Right, yeah, okay. Let's move to the Daily thoughts on daily thoughts chat. That seems to be where most miscellaneous conversation happens anyways. Good job solving the puzzle!",
        "user": "Robot1311213"
    },
    {
        "chat_name": "I found something strange",
        "text": "You know the post from yesterday with the pictures from Spain? If you make the webpage smaller, they change into another picutre and numbers!",
        "user": "Tree123"
    },
    {
        "text": "Woah, really? That's so cool! I had no idea.",
        "user": "icniVad"
    },
    {
        "text": "Seems to be a park entrance and a long list of numbers. Some of the numbers have letters by them as well. The letters seem to me to be compass directions what with having n, w, e, s for north, west, east, south. At least that's the immediate thought that springs to mind.",
        "user": "icniVad"
    },
    {
        "text": "That seems reasonable. Then SE would be South-East and so on, right?",
        "user": "Tree123"
    },
    {
        "text": "Yeah exactly. That's my thinking.",
        "user": "icniVad"
    },
    {
        "text": "Though i'm not quite sure what the other numbers are for. Or how we're supposed to use the directions. At least not yet.",
        "user": "icniVad"
    },
    {
        "text": "I see you have discovered a new puzzle. I briefly researched the word visible in the picture to the left. It seems to be some kind of garden society.",
        "user": "Mr X"
    },
    {
        "text": "Probably situated in Gothenburg since that's where Robot and Fexjo live. I think I can find where the picture is from, just give me a minute.",
        "user": "icniVad"
    },
    {
        "text": "Seems to be pretty close to the train station, you can check it out on maps.",
        "user": "icniVad"
    },
    {
        "text": "Question is what the garden has to do with the numbers. Maybe something is hidden in the garden and we have to find something that the numbers indicate?",
        "user": "icniVad"
    },
    {
        "text": "That is a possibility. So while we need to figure the numbers out, we also need to find somebody who can go there later.",
        "user": "Mr X"
    },
    {
        "text": "Any recruits willing?",
        "user": "icniVad"
    },
    {
        "text": "I could do it, maybe. If you tell me where to go and what to do there.",
        "user": "Tree123"
    },
    {
        "text": "Indeed. We'll have to figure out that first. The first question should be whether to figure out the numbers with the compass directions or the ones without them. I feel like they are two distinct groups but I could be wrong. Worth noting is at the bottom of the list we have a different format for the last content. This could mean something important as well.",
        "user": "icniVad"
    },
    {
        "text": "I agree with the notion that the meanings are separate. However, they are together in pairs, and that is probably also significant. I do believe that the compass directions simply are that, as 34 degrees is to the north. The N is likely present only as a hint.",
        "user": "Mr X"
    },
    {
        "text": "Makes sense to me. But what meaning does the other number represent then?",
        "user": "icniVad"
    },
    {
        "text": "If we have directions, we also need distance. I strongly suspect those numbers tells us about this.",
        "user": "Mr X"
    },
    {
        "text": "True true. They represent meters then? That makes most sense to me.",
        "user": "icniVad"
    },
    {
        "text": "Time for Tree to go then?",
        "user": "icniVad"
    },
    {
        "text": "I won't go in the rain today. And I'm busy tomorrow. But maybe after that. How will I even measure? Just try to take meter steps? And where do I start?",
        "user": "Tree123"
    },
    {
        "text": "By one of the garden entrances i'm assuming. I'm pretty sure there's an app to measure meters otherwise. Though i'm sure steps could be a good substitute.",
        "user": "icniVad"
    },
    {
        "text": "Well, I'll try and we'll see how jt goes, I guess.",
        "user": "Tree123"
    },
    {
        "text": "Enjoy your trip",
        "user": "Mr X"
    },
    {
        "text": "Good luck!",
        "user": "icniVad"
    },
    {
        "text": "So, I went. It took some guessing and back and forth. But in the end I arrived at a locker. The last number should be the number of it. Now the ball is back in your court, I need a number of 9 digits to open it.",
        "user": "Tree123"
    },
    {
        "text": "9 numbers huh? Interesting. Could it be hidden in the other numbers of the coordinates. Maybe they fixed the distance count to also hide the combination for the locker?",
        "user": "icniVad"
    },
    {
        "text": "If that was the case, it would truly be an ingenious puzzle. Let us commence the search.",
        "user": "Mr X"
    },
    {
        "text": "Lets indeed.",
        "user": "icniVad"
    },
    {
        "text": "I can see no pattern in the numbers, nor any that seem different. What have you found?",
        "user": "Mr X"
    },
    {
        "text": "I noticed that Fexjo mentioned Robot and his cleaning. It just so happens that Robot posted about that on the same day. That can't be a coincidence. Especially since Robot is usually the one making the puzzles, not Fexjo.",
        "user": "icniVad"
    },
    {
        "text": "That is true. There are many numbers present in that post as well. The simplest solution would be to place them after eachother, but perhaps it is more difficult than that?",
        "user": "Mr X"
    },
    {
        "text": "Let's come up with a few options before we send Tree out again. I'm sure she would be annoyed going back and forth to try our suggestions one by one.",
        "user": "icniVad"
    },
    {
        "text": "That is the same as my own thoughts. Though I have found no other clue on how to combine any numbers. No new digits have appeared in odd positions anywhere on the website as far as I know.",
        "user": "Mr X"
    },
    {
        "text": "It could be that we have to order the items alphabetically and thus get the order of the numbers, with the numbers being the amount of items found.",
        "user": "icniVad"
    },
    {
        "text": " Could you list the combinations so I know what to test?",
        "user": "Tree123"
    },
    {
        "text": "I've come up with three different combinations to try. The first, and most simple, is: 205212269. This is the numbers in order of appearance. If it doesn't work then I suggest: 220369512. This is by ordering the words in alphabetical order. My last suggestion is: 202691225. This is similar to the other alphabetical order but uses slightly different words, those that I deem is possible to be indicated. I was also thinking of a potential arithmetic secret of how to change the numbers into a different nine lettered number but never quite got something that made sense to me. Those are my suggestions for what combinations to try, but maybe Mr X has some additional ideas?",
        "user": "icniVad"
    },
    {
        "text": "I have also not managed to find an arithmetic sequence that results in a 9-digit number. However, I have one last combination to test. Robot1311213's numbers represent letters. So I did the opposite with 'marble' as that is mentioned as an obsession he may still have which could be significant. In that case, the code becomes 121182125.",
        "user": "Mr X"
    },
    {
        "text": "Man, that's genius! I actually hope that's the right combination now, I would love that.",
        "user": "icniVad"
    },
    {
        "text": "Is that all? Or do you want me to wait a few days before going in case you missed something?",
        "user": "Tree123"
    },
    {
        "text": "Depends on how much of a bother it is for you. I would certainly like the trip to be done as soon as possible but I'm also not the one going there in person.",
        "user": "icniVad"
    },
    {
        "text": "I could go either tomorrow or next weekend. So either I try earlier or we wait a bit to have some more time to think. But this is my second time going and I would appreciate if there wasn't a third.",
        "user": "Tree123"
    },
    {
        "text": "I vote for tomorrow. Could be because I'm impatient but I feel that I wouldn't come up with any new combination even with the extra time. One of these are bound to be correct. Also, before you leave tomorrow you could always check the chat again and see if we’ve come up with anything else. I will at least spend most of the night thinking up possibilities so you won't have to have a wasted trip. And so that the puzzle will be solved.",
        "user": "icniVad"
    },
    {
        "text": "Proceed tomorrow, please.",
        "user": "Mr X"
    },
    {
        "text": "Sure. I'll go tomorrow then",
        "user": "Tree123"
    },
    {
        "text": "I'll look forward to hearing about the results.",
        "user": "icniVad"
    },
    {
        "text": "No new ideas? Then I'll be going now",
        "user": "Tree123"
    },
    {
        "text": "Here's hoping we're correct.",
        "user": "icniVad"
    },
    {
        "text": "It opened!",
        "user": "Tree123"
    },
    {
        "text": "Nice! What's in it?",
        "user": "icniVad"
    },
    {
        "text": "It seems to be a game called 'Codenames'?",
        "user": "Tree123"
    },
    {
        "text": "I love codenames! It's a really fun game, I play it all the time when I'm with my family. Have you played it before?",
        "user": "icniVad"
    },
    {
        "text": "Maybe it indicates that something we've already gone through is a codename for something else?",
        "user": "icniVad"
    },
    {
        "text": "I don't know the game. Maybe you could tell us a bit about it? Perhaps there's a clue in how it works.",
        "user": "Tree123"
    },
    {
        "text": "It's not too complicated. You have a grid of regular words. Some of the words is assigned to one team and some of them to the other. Only the team leaders know which ones though. Then the team leaders take turn saying a word, not one that is displayed, and how many displayed words that it is applied to. The goal is to say a different word, a codename if you will, which has some sort of connection with your assigned words and get your other team members to guess the words that have been assigned to you. There's some other details and varieties but that's the gist of it.",
        "user": "icniVad"
    },
    {
        "text": "Hm. Sounds fun but like you have to be quite a few people to play it.",
        "user": "Tree123"
    },
    {
        "text": "Anyway, I opened the box to check it out and there was a strange card in it.",
        "user": "Tree123"
    },
    {
        "text": "Oh yeah? What did it say?",
        "user": "icniVad"
    },
    {
        "text": "Only one word 'meeple'. I googled it and it seems to be a game piece?",
        "user": "Tree123"
    },
    {
        "text": "Indeed, hmm, this requires some thinking. Though it's definitely out of the ordinary for codenames so I believe this is the clue we were looking for.",
        "user": "icniVad"
    },
    {
        "text": "Have you not seen the other post with a blank inside? Surely, it is related to this.",
        "user": "Mr X"
    },
    {
        "text": "Isn't this the first time so many posts are used in the same puzzle? Wasn't it always a single one before?",
        "user": "Tree123"
    },
    {
        "text": "Maybe Robot is stepping up his game?",
        "user": "icniVad"
    },
    {
        "text": "I tried it and meeplelikeus is a website reviewing games. Could definitely be related.",
        "user": "icniVad"
    },
    {
        "text": "This truly seems to be the right direction.",
        "user": "Mr X"
    },
    {
        "text": "Maybe he is. I seem to remeber that the first few puzzles were easier",
        "user": "Tree123"
    },
    {
        "text": "Robot is really stepping up his game now. Multiple posts, physical locker, and a whole different website.  I like where this is going.",
        "user": "icniVad"
    },
    {
        "text": "I couldn't solve this at all. You guys are amazing.",
        "user": "Tree123"
    },
    {
        "text": "It's not over yet though. We still need this website for something.",
        "user": "icniVad"
    },
    {
        "text": "So I've been thinking after not finding the next clue. This puzzle has already involved different posts and such right? Robot even dragged in Fexjo with this. Then it stands to reason that we could find something else in a different post. I can't help but notice how Robot posted a new post today about accessibility in games. This seems like something meeplelikeus talks about. It's probably were we input the solution seeing as there’s a password box, just like that april fools post if you guys remember? It also seems like Robot is keeping a track of how we're doing since he gradually releases the posts that continues the puzzle.",
        "user": "icniVad"
    },
    {
        "text": "No, you guys are just too fast. (ーー;) I was planning on gradually releasing them to seem natural. Still, good job so far, keep at it.",
        "user": "Robot1311213"
    },
    {
        "text": "I appreciate the praise. Let us investigate this website.",
        "user": "Mr X"
    },
    {
        "text": "Indeed, lets. Now we just need to figure out where to start, this website has a lot of info.",
        "user": "icniVad"
    },
    {
        "text": "You said it had a lot of info about gaming, right? Then wouldn't an obvious place be with Codenames?",
        "user": "Tree123"
    },
    {
        "text": "Certainly, how could I have missed it?",
        "user": "Mr X"
    },
    {
        "text": "Of course! That makes a lot of sense.",
        "user": "icniVad"
    },
    {
        "text": "I have read the article and encountered no peculiar word that I thought Robot would have chosen.",
        "user": "Mr X"
    },
    {
        "text": "I have found out that codenames have two articles. One for an assessment of the game and another for an assessment for it's accessibility. I think it's the latter one we're supposed to look at judging by the content of the latest post. I haven't found any word in particular that would fit though.",
        "user": "icniVad"
    },
    {
        "text": "Now that I ponder it further, I wonder it is actually a word we are seeking on that page. Robot only says it is an 8-letter answer. It could simply a code somewhere.",
        "user": "Mr X"
    },
    {
        "text": "Hmm. Maybe. I'm going to keep looking for words though. You're welcome to look for codes and we can try to tackle it from two fronts.",
        "user": "icniVad"
    },
    {
        "text": "I find it hard to know what the code is. To begin with, are we sure it is the basic version of Codenames we should read about?",
        "user": "Mr X"
    },
    {
        "text": "I think that is what I now own at least",
        "user": "Tree123"
    },
    {
        "text": "Then that should be the case. Did you find anything that could be a password daVinci?",
        "user": "Mr X"
    },
    {
        "text": "Maybe the bgg rank that they have, 372? Or potentially the word Watney, which is the only word in one of the figure texts. Honestly, they don't quite feel like the right answer. The best I could think of was Colour Blindness, which had the highest rank of the different accessibility features of codenames. However, I tried it and it didn't give me anything so I'm not quite sure.",
        "user": "icniVad" 
    },
    {
        "text": "And we also have the 8-letter constraint. I tried Codename, just to be sure but nothing there either.",
        "user": "Mr X"
    },
    {
        "text": "Well I checked it out and there are 8 categories. Could that be something?",
        "user": "Tree123"
    },
    {
        "text": "The first letter from each category potentially? I tried them in the order they're shown but maybe something else will give a hint of their order?",
        "user": "icniVad"
    },
    {
        "text": "Maybe the way they're scored!?",
        "user": "icniVad"
    },
    {
        "text": "Hmm, never mind. Didn't seem to work. But i'm sure i'm on to something here. Maybe it's just not the first letter but something else. It has to be something about their order of scoring.",
        "user": "icniVad"
    },
    {
        "text": "The grading!",
        "user": "Mr X"
    },
    {
        "text": "How uncharacteristic with such excitement from you, X",
        "user": "Tree123"
    },
    {
        "text": "Did you figure out what we're supposed to glean from the categories? What with the grading representing the order?",
        "user": "icniVad"
    },
    {
        "text": "The password is simply the grade from top to bottom. ABCCABAC.",
        "user": "Mr X"
    },
    {
        "text": "Wait, really? Wow, you're right, I just tried it out now. I guess you've already messaged Robot about the reward huh?",
        "user": "icniVad"
    },
    {
        "text": "Yes. Why would I otherwise tell it for all to know?",
        "user": "Mr X"
    },
    {
        "text": "Fair enough. Congratulations on your prize. To be honest i'm happy we solved it even if I didn't get a reward. Though of course i'm a little bit disappointed I wasn't the one who solved it in the end but that's life sometimes.",
        "user": "icniVad"
    },
    {
        "text": "This one is the first where the puzzle is across several posts right? And even in the real world! I'm impressed",
        "user": "Tree123"
    },
    {
        "text": "Good job everyone (^-^)",
        "user": "Pinnipedia"
    },
    {
        "text": "It was a most entertaining puzzle. See you all next time.",
        "user": "Mr X"
    },
    {
        "chat_name": "Daily thoughts about Daily Thoughts",
        "text": "I'm not one for chatting, so why do we even have this in the first place? I highly doubt that we will get many visitors and an empty chat is just sad.",
        "user": "Fexjo"
    },
    {
        "text": "It's a good thing to have. I'm sure some people will arrive eventually.",
        "user": "Robot1311213"
    },
    {
        "text": "Really? At least one of us is optimistic.",
        "user": "Fexjo"
    },
    {
        "text": "We never expected this to be a viral hit anyways. Let me invite one of my friends and we can get a conversation going.",
        "user": "Robot1311213"
    },
    {
        "text": "Hey! How's it going?",
        "user": "SpikeyTike"
    },
    {
        "text": "Pretty good. Welcome to our website, what do you think?",
        "user": "Robot1311213"
    },
    {
        "text": "I'm impressed that you guys have done this all by yourselves. I definitely wouldn't be able to create something like this.",
        "user": "SpikeyTike"
    },
    {
        "text": "It was mostly Robot coding. I only did a few things.",
        "user": "Fexjo"
    },
    {
        "text": "Don't be so humble! Robot has told me all about it. It was mostly your idea anyways right?",
        "user": "SpikeyTike"
    },
    {
        "text": "That's Robot being humble! I only told him to google his errors every now and then. But yeah, I guess I should admit to being the first to mentioning a blog. But it was still Robot who made it a reality!",
        "user": "Fexjo"
    },
    {
        "text": "I'm just impressed is all. I think i'm going to invite my sister here. I'm sure she would love to check out the place.",
        "user": "SpikeyTike"
    },
    {
        "text": "Hello Robot1311213! Hello Fexjo!",
        "user": "DiggerTigger"
    },
    {
        "text": "I assume you are related to SpikeyTike? No way you just stumbled upon this blog. We created it like two days ago.",
        "user": "Fexjo"
    },
    {
        "text": "This is my sister. Current second user of the website. It's already getting popular.",
        "user": "SpikeyTike"
    },
    {
        "text": "Hope you enjoy your stay.",
        "user": "Robot1311213"
    },
    {
        "text": "Wait a second. Why didn't you say hello to me!? What kind of sister are you? No family love at all.",
        "user": "SpikeyTike"
    },
    {
        "text": " I meet you every day anyway so I thought you'd be fine without.",
        "user": "DiggerTigger"
    },
    {
        "text": "I feel wounded by the disregard of my own sister. Alas, such is life.",
        "user": "SpikeyTike"
    },
    {
        "text": "Well, what about me then? No-one has said hello to me!",
        "user": "DiggerTigger"
    },
    {
        "text": "Hello DiggerTigger, how are you today?",
        "user": "Robot1311213"
    },
    {
        "text": "Yay! Now I'm great, thank you.",
        "user": "DiggerTigger"
    },
    {
        "text": "Hello, I guess?",
        "user": "Fexjo"
    },
    {
        "text": ":)",
        "user": "DiggerTigger"
    },
    {
        "text": "What is your opinion on dinosaurs?",
        "user": "Robot1311213"
    },
    {
        "text": "Asking the important questions here. I find them alright myself.",
        "user": "SpikeyTike"
    },
    {
        "text": "Eh, dinosaurs? Well they are big?",
        "user": "DiggerTigger"
    },
    {
        "text": "Great contribution. Very good job.",
        "user": "SpikeyTike"
    },
    {
        "text": "Most are, though not all of them.",
        "user": "Robot1311213"
    },
    {
        "text": "Really? Are there any cute small ones?",
        "user": "DiggerTigger"
    },
    {
        "text": "Oh there are plenty. A good example is the Compsognathus, which only got about as big as a turkey. I would classify it as cute.",
        "user": "Robot1311213"
    },
    {
        "text": "If you say so. Could we change the subject?",
        "user": "DiggerTigger"
    },
    {
        "text": "You don't enjoy the conversation? I see, I see. Any brilliant conversational topics from you?",
        "user": "SpikeyTike"
    },
    {
        "text": "Trying to put me on the spot? Well, what about favorite shapes? I really like parallelograms.",
        "user": "DiggerTigger"
    },
    {
        "text": "I personally think that hexagons are the bestagons.",
        "user": "Robot1311213"
    },
    {
        "text": "Definitely hyperboloids.",
        "user": "Fexjo"
    },
    {
        "text": "Really? Shapes? Couldn't come up with anything better huh?",
        "user": "SpikeyTike"
    },
    {
        "text": "There's nothing wrong with shapes! At least it is more fun than colours or whatever. Besides, everyone except you has answered so it is your turn.",
        "user": "DiggerTigger"
    },
    {
        "text": "I like circles I guess.",
        "user": "SpikeyTike"
    },
    {
        "text": "I've always been a fan of triangles myself.",
        "user": "icniVad"
    },
    {
        "text": "Wait, who are you?",
        "user": "icniVad"
    },
    {
        "text": "I just thought this seemed interesting so I decided to check it out.",
        "user": "icniVad"
    },
    {
        "text": "That doesn't answer anything though.",
        "user": "SpikeyTike"
    },
    {
        "text": "Welcome! Hope you enjoy your stay.",
        "user": "Robot1311213"
    },
    {
        "text": "Thank you! I'm sure I will.",
        "user": "icniVad"
    },
    {
        "text": "Are you celebrating the launch of this website somehow? Except inviting people.",
        "user": "DiggerTigger"
    },
    {
        "text": "I'm sure a thing or two might come up. Better keep an eye out (^_-)",
        "user": "Robot1311213"
    },
    {
        "text": "Hmm. Is that not your way of making us stay?",
        "user": "DiggerTigger"
    },
    {
        "text": "Now that would be telling.",
        "user": "Robot1311213"
    },
    {
        "text": "So what's up with this website anyways? Seems a bit interesting but not much content yet.",
        "user": "icniVad"
    },
    {
        "text": "There's what, two posts and a chat?",
        "user": "DiggerTigger"
    },
    {
        "text": "We are just starting out after all.",
        "user": "Fexjo"
    },
    {
        "text": "Could be interesting to see where it's going at least. And always nice to be able to chat with some new people.",
        "user": "SpikeyTike"
    },
    {
        "text": " I've always thought of myself as more of a lurker.",
        "user": "icniVad"
    },
    {
        "text": "Me to, actually. I just invited a recent friend of mine. So I'm out when that person can communicate with you all instead.",
        "user": "Fexjo"
    },
    {
        "text": "Looking forward to meeting them",
        "user": "SpikeyTike"
    },
    {
        "text": "I'm the person Fexjo just mentioned. So I guess he'll leave and you have to make do with me? Anyway I just tuned in to say hello. I'm really busy today, so see you another day!",
        "user": "Tree123"
    },
    {
        "text": "Welcome welcome! See you later.",
        "user": "SpikeyTike"
    },
    {
        "text": "I don't think i've ever said hi and bye in a single message before. Now if that's not weird I don't know what is.",
        "user": "SpikeyTike"
    },
    {
        "text": "It's not that bad. Tree123 seems really busy so it's fine.",
        "user": "DiggerTigger"
    },
    {
        "text": "We'll have to check in tomorrow I guess.",
        "user": "SpikeyTike"
    },
    {
        "text": "Well I can agree with you on that at least. I have bus to catch.",
        "user": "DiggerTigger"
    },
    {
        "text": "See you all later!",
        "user": "DiggerTigger"
    },
    {
        "text": "Bye!",
        "user": "Robot1311213"
    },
    {
        "text": "Very interesting Robot. I wonder what you mean by the latest post? Is this a challenge? Time to put on the good old detective hat.",
        "user": "icniVad"
    },
    {
        "text": "You actually have one of those?",
        "user": "DiggerTigger"
    },
    {
        "text": "Does it look like the one Sherlock Holmes has?",
        "user": "DiggerTigger"
    },
    {
        "text": "Why of course. What self-respecting enterprising individual would lack something so clearly ingrained in the art of investigating secrets and mysteriums.",
        "user": "icniVad"
    },
    {
        "text": "I think he's messing with you.",
        "user": "SpikeyTike"
    },
    {
        "text": "I would like to believe that people are honest",
        "user": "DiggerTigger"
    },
    {
        "text": "Sorry. Just always wanted to seem cool you know. But i'm definitely going to buy one sometime soon. If I can even find one.",
        "user": "icniVad"
    },
    {
        "text": "I'll just leave and nurse my broken trust back to health then. See you when I'm done.",
        "user": "DiggerTigger"
    },
    {
        "text": " I'm very sorry. Won't happen again.",
        "user": "icniVad"
    },
    {
        "text": "Let's get back to business though. Anyone interested in figuring out the new post?",
        "user": "icniVad"
    },
    {
        "text": "I guess I could discuss it with you. Although do not expect any brilliant insights from me",
        "user": "Tree123"
    },
    {
        "text": "If you're going to discuss the latest post specifically then you might want to create a new chat room.",
        "user": "Robot1311213"
    },
    {
        "text": "Would love to have your help. I find that conversation can help ease problem solving.",
        "user": "icniVad"
    },
    {
        "text": "You might have a point Robot, i'll get on that. For anyone interested i've invited everyone to a chat called Usernames? where we can discuss this.",
        "user": "icniVad" 
    },
    {
        "text": "Alright I'll go there too!",
        "user": "Tree123"
    },
    {
        "text": "I'm surprised so many things were made in Sweden, it's such a tiny country.",
        "user": "Tree123"
    },
    {
        "text": "Thanks for the dinosaur! It helped me heal completely and now I'm back!",
        "user": "DiggerTigger"
    },
    {
        "text": "Maybe I should invest in a dinosaur. Could be useful to have around whenever you're in a mood.",
        "user": "SpikeyTike"
    },
    {
        "text": "And were would you even keep it?",
        "user": "DiggerTigger"
    },
    {
        "text": "Your room is a mess!",
        "user": "DiggerTigger"
    },
    {
        "text": "I'm sure I could keep a stuffed animal somewhere. There's plenty of good places. And I prefer organised chaos, thank you very much.",
        "user": "SpikeyTike"
    },
    {
        "text": "Never too late to take an interest in dinosaurs in my opinion.",
        "user": "Robot1311213"
    },
    {
        "text": "Well, some are quite nice. But certainly not all",
        "user": "DiggerTigger"
    },
    {
        "text": "Ah, but that's the beauty of it. You don't have to like them all. In fact, there's so many of them that even if you only like a small subset there'll be plenty of variety still.",
        "user": "Robot1311213" 
    },
    {
        "text": "I feel like we've gotten off track. Where did this conversation even start anyways?",
        "user": "SpikeyTike"
    },
    {
        "text": "With me?",
        "user": "DiggerTigger"
    },
    {
        "text": "You did? Oh yeah! You liked the new dino post. Forgot about that. It was pretty cute I guess.",
        "user": "SpikeyTike"
    },
    {
        "text": "Well, your memory has been bad recently. We are waiting for you now, did you forget the dinner tonight?",
        "user": "DiggerTigger"
    },
    {
        "text": "Wait, dinner? It's that time already!? And what are you doing on your phone while we're supposed to have dinner anyways? I'm on my way right now.",
        "user": "SpikeyTike" 
    },
    {
        "text": "I'll make up an excuse for you, but hurry up",
        "user": "DiggerTigger"
    },
    {
        "text": "I'll be there in maybe 5 minutes. Thanks.",
        "user": "SpikeyTike"
    },
    {
        "text": "Regarding todays post do you guys have any pets? Or what would it be if you did?",
        "user": "Tree123"
    },
    {
        "text": "I'm definitely a dog person. I used to have a german sheperd, though that was quite a while ago. I've been thinking of maybe getting a greyhound or a husky. Not quite decided yet.",
        "user": "SpikeyTike"
    },
    {
        "text": "Yeah, that dog was lovely. I am more of a collie or samoyed person myself. Imagine petting all that fur!",
        "user": "DiggerTigger"
    },
    {
        "text": "Imagine cleaning up all the fur they shed. No thank you, I think i'll stick with shorter haired dogs.",
        "user": "SpikeyTike"
    },
    {
        "text": "Well. It could be punishment for losing the bets we keep making.",
        "user": "DiggerTigger"
    },
    {
        "text": "I'll have to think up some good punishment for you then. Cause you're going down next time!",
        "user": "SpikeyTike"
    },
    {
        "text": "Am not!",
        "user": "DiggerTigger"
    },
    {
        "text": "Am so.",
        "user": "SpikeyTike"
    },
    {
        "text": "It's on!",
        "user": "DiggerTigger"
    },
    {
        "text": "Let's go! I'll be there in 2 minutes and we'll see who's get the best of it!",
        "user": "DiggerTigger"
    },
    {
        "text": "I honestly never paid attention to the tram names and numbers when I lived in Gothenburg. Beyond remembering which ones I needed to take to get anywhere. But it seems like it could be an interesting exercise. Too bad I'm not nearby where I could participate.",
        "user": "SpikeyTike" 
    },
    {
        "text": "I'm new to Gothenburg just like Fexjo and wondered about them",
        "user": "Tree123"
    },
    {
        "text": "Perhaps you did not notice them because you see them often?",
        "user": "Tree123"
    },
    {
        "text": "Could be. Never really thought about it I guess.",
        "user": "SpikeyTike"
    },
    {
        "text": "So where's your sister? You usually appear joined at the hip but this time she hasn't appeared even though you've written a few messages. Is she okay?",
        "user": "icniVad"
    },
    {
        "text": "Hey! We have our own lives you know. We're not always together. She's just busy with her own things, just like I am.",
        "user": "SpikeyTike"
    },
    {
        "text": "I was just curious.",
        "user": "icniVad"
    },
    {
        "text": "It's alright. It is true that we are often together though. We just have a good sibling relationship. Quite healthy with a lot of communication you know?",
        "user": "SpikeyTike"
    },
    {
        "text": "What's everyones favorite fika?",
        "user": "DiggerTigger"
    },
    {
        "text": "Definitely a classic cinnamon roll for me.",
        "user": "SpikeyTike"
    },
    {
        "text": "I prefer chocolate balls. Though some variety never hurts.",
        "user": "Robot1311213"
    },
    {
        "text": "I'm surprised at all the classics coming up",
        "user": "DiggerTigger"
    },
    {
        "text": "The real magic is in the drinks. A hot cocoa sits right when it comes to fika.",
        "user": "SpikeyTike"
    },
    {
        "text": "What do you mean by that? You saying I don't appreciate the classics? The accusation hurts me deep. Straight through the heart.",
        "user": "SpikeyTike"
    },
    {
        "text": "I do, but those are not what I would choose if I could only eat one thing for fika for a month",
        "user": "DiggerTigger"
    },
    {
        "text": "What would you choose?",
        "user": "SpikeyTike"
    },
    {
        "text": "Radiocake",
        "user": "DiggerTigger"
    },
    {
        "text": "Hmm, you have a point. That is pretty delicious.",
        "user": "SpikeyTike"
    },
    {
        "text": "Let's bake some?",
        "user": "DiggerTigger"
    },
    {
        "text": "What is that? I've never heard of radiocake.",
        "user": "Tree123"
    },
    {
        "text": "Oh you're in for a treat.",
        "user": "SpikeyTike"
    },
    {
        "text": "Simply explained it is ice chocolate and crackers",
        "user": "DiggerTigger"
    },
    {
        "text": "Just search for a recipe and try. It's delicious.",
        "user": "DiggerTigger"
    },
    {
        "text": "Hm. Maybe another day",
        "user": "Tree123"
    },
    {
        "text": "Just remember to write it down. Can't recommend it enough.",
        "user": "SpikeyTike"
    },
    {
        "text": "sure",
        "user": "Tree123"
    },
    {
        "text": "I'm in the same exchange program in Fexjo and the night with SKIP was really fun",
        "user": "Tree123"
    },
    {
        "text": "I've heard some stuff about similar things but never really went to them myself. What were some of the things you guys did?",
        "user": "SpikeyTike"
    },
    {
        "text": "We played a lot of board games. Ate a drank and had a blast with other people. Basically",
        "user": "Tree123"
    },
    {
        "text": "Sounds like fun. Maybe I should check out if something similar is organised close by.",
        "user": "SpikeyTike"
    },
    {
        "text": "You really should. And it is cheap as a student as well.",
        "user": "Tree123"
    },
    {
        "text": "But did you ever make that cake? Was it as good as you remember it?",
        "user": "Tree123"
    },
    {
        "text": "Even better. How about you? Somewhat of a baker yourself?",
        "user": "SpikeyTike"
    },
    {
        "text": "Sometimes. It is a bit harder now when I'm not at home with a larger kitchen and more tools.",
        "user": "Tree123"
    },
    {
        "text": "You make do with what you have and improvise. God knows that I have experience in that area.",
        "user": "SpikeyTike"
    },
    {
        "text": "Any stories to tell?",
        "user": "Tree123"
    },
    {
        "text": "There was this one time he was making sponge cake...",
        "user": "DiggerTigger"
    },
    {
        "text": "Nothing in particular. Just a general lack of appliances.",
        "user": "SpikeyTike"
    },
    {
        "text": "WE DON'T TALK ABOUT THE SPONGE CAKE!",
        "user": "SpikeyTike"
    },
    {
        "text": "Really? How will you repay me for keeping quiet? Bake me a...",
        "user": "DiggerTigger"
    },
    {
        "text": "... sponge cake?",
        "user": "DiggerTigger"
    },
    {
        "text": "You're treading dangerous water here…",
        "user": "SpikeyTike"
    },
    {
        "text": "Watch out so I don't come get you. I know where you live you know. And then we'll see if you can stomach a sponge cake.",
        "user": "SpikeyTike"
    },
    {
        "text": "Bake it please? If you come over I have newly made chocolate balls? With coconut?",
        "user": "DiggerTigger"
    },
    {
        "text": "You make a very convincing case. I'll be right over.",
        "user": "SpikeyTike"
    },
    {
        "text": "So I won't get to hear the story? That's too bad...",
        "user": "Tree123"
    },
    {
        "text": "Were there any seals at Universeum? I would love to see some pictures if you have them. I feel like you have too much focus on dinosaurs and could do with some more diversifying the content.",
        "user": "Pinnipedia"
    },
    {
        "text": "Could definitely use more seals.",
        "user": "Pinnipedia"
    },
    {
        "text": "A new person I believe?",
        "user": "Tree123"
    },
    {
        "text": "Welcome welcome!",
        "user": "Robot1311213"
    },
    {
        "text": "What's your favorite shape?",
        "user": "DiggerTigger"
    },
    {
        "text": "Round at the middle and tapered at the ends.",
        "user": "Pinnipedia"
    },
    {
        "text": " If you're curious about the shape I'm describing, look no further than your nearest favourite marine mammal.",
        "user": "Pinnipedia"
    },
    {
        "text": "Tigers?",
        "user": "DiggerTigger"
    },
    {
        "text": "I'm confused",
        "user": "DiggerTigger"
    },
    {
        "text": "I don't think tigers are marine mammals.",
        "user": "SpikeyTike"
    },
    {
        "text": "Oops. I read mammals.",
        "user": "DiggerTigger"
    },
    {
        "text": "But not marine",
        "user": "DiggerTigger"
    },
    {
        "text": " I'm still confused though, what do shapes have to do with dolphins then?",
        "user": "DiggerTigger"
    },
    {
        "text": "Enough of that. Wasn't it ages since Robot showed up in the chat? Welcome back!",
        "user": "DiggerTigger"
    },
    {
        "text": "Thanks. I've been a bit busy lately but found some time now for this.",
        "user": "Robot1311213"
    },
    {
        "text": "I think Pinnipedia might be referring to seals. The shape fits the description and she mentioned them before.",
        "user": "icniVad"
    },
    {
        "text": "Oh. I see. I feel a bit dumb now.",
        "user": "DiggerTigger"
    },
    {
        "text": "To be honest I didn't get it either.",
        "user": "SpikeyTike"
    },
    {
        "text": "Might have been a bit too cryptic, hehe. IcniVad figured it out at least.",
        "user": "Pinnipedia"
    },
    {
        "text": "Anyway are you a wikipedia or something?",
        "user": "DiggerTigger"
    },
    {
        "text": "I'm more of a pinniped. But I have been known for my knowledge about certain subjects before.",
        "user": "Pinnipedia"
    },
    {
        "text": "What's a pinniped?",
        "user": "DiggerTigger"
    },
    {
        "text": "A seal apparently. Google to the rescue.",
        "user": "SpikeyTike"
    },
    {
        "text": "Hm. So we have both a seal-lover and a dinosaur-lover. Think they'll get along?",
        "user": "DiggerTigger"
    },
    {
        "text": "I'm sure they'll catch on like a house on fire.",
        "user": "SpikeyTike"
    },
    {
        "text": "Is that a good thing?",
        "user": "DiggerTigger"
    },
    {
        "text": "Dunno. I guess we'll see.",
        "user": "SpikeyTike"
    },
    {
        "text": "I'm still here you know…",
        "user": "Pinnipedia"
    },
    {
        "text": "I'm also here actually... But yeah, they do that sometime. Keeps talking in their own world of sibling love.",
        "user": "Tree123"
    },
    {
        "text": "Kinda cute in a way.",
        "user": "Pinnipedia"
    },
    {
        "text": "With that comment I'll guess we'll see you around more?",
        "user": "Tree123"
    },
    {
        "text": "Sure, I'd love to participate in some conversations.",
        "user": "Pinnipedia"
    },
    {
        "text": "I just saw the chat about the usernames. Seemed like an interesting puzzle. Not really my thing but I'll invite a friend of mine who enjoys these kinds of things. Always nice to have new people to websites like these as well.",
        "user": "Pinnipedia" 
    },
    {
        "text": "This is assuming that this isn't a one time thing. Though judging by the About page I would hope that it isn't.",
        "user": "Pinnipedia"
    },
    {
        "text": "As I said in the second post, you can expect several more from the Robot himself.",
        "user": "Fexjo"
    },
    {
        "text": "Looking forward to it.",
        "user": "icniVad"
    },
    {
        "text": "How long do you think it will take before the next one? It's been a month.",
        "user": "Tree123"
    },
    {
        "text": "I guess it depends on how Robot is making his puzzles. If he has a bunch already planned out then probably quite soon but if he takes it as he goes then there's no telling how long it'll take. It also depends on the complexity behind the puzzles.",
        "user": "icniVad"
    },
    {
        "text": "Seems like this could turn into a puzzle enthusiast website. I think I'll stick to the general chat though. Never been much of a puzzle solver.",
        "user": "SpikeyTike"
    },
    {
        "text": "That's one of few things we have in common.",
        "user": "DiggerTigger"
    },
    {
        "text": "It'll be interesting to see how fast the others can solve it though (.❛ ᴗ ❛.)",
        "user": "Pinnipedia"
    },
    {
        "text": "True",
        "user": "DiggerTigger"
    },
    {
        "text": "Ah. A fellow kaomoji user. I salute you. (￣^￣)ゞ",
        "user": "Robot1311213"
    },
    {
        "text": "(b ᵔ▽ᵔ)b",
        "user": "Pinnipedia"
    },
    {
        "text": "Hey, Robot! When do you think the next puzzle will be out?",
        "user": "Tree123"
    },
    {
        "text": "I can't reveal all my secrets now can I? ( ͡° ͜ʖ ͡°)",
        "user": "Robot1311213"
    },
    {
        "text": "What a tease.",
        "user": "icniVad"
    },
    {
        "text": "Come on! Pretty please with sugar on top?",
        "user": "DiggerTigger"
    },
    {
        "text": "Have patience and I'm sure you'll be happy with the results. Who knows, a puzzle might already exist and be undiscovered. ( ͡• ͜ʖ ͡• )",
        "user": "Robot1311213"
    },
    {
        "text": "Wait, what? I guess it's time to scour the website for clues!",
        "user": "icniVad"
    },
    {
        "text": "Have fun",
        "user": "Tree123"
    },
    {
        "text": "Good luck.",
        "user": "Pinnipedia"
    },
    {
        "text": "I can't seem to find anything no matter how much I look. I have searched everywhere. Maybe I'm missing something? A hidden link somewhere is my current theory.",
        "user": "icniVad"
    },
    {
        "text": "There is a high probability that you have searched in vain. He simpliy said that a puzzle might exist, with extra being the key word here, to deter you from further questioning.",
        "user": "Mr X"
    },
    {
        "text": "Well I'm sure you enjoyed everything we have on the website so far though (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧",
        "user": "Robot1311213"
    },
    {
        "text": "I admit that it might have been a red herring but i'm definitely going to keep an eye out. Who knows what secrets are yet unrevealed or what will be added without notice.",
        "user": "icniVad" 
    },
    {
        "text": "Would you be the friend Pinnipedia mentioned? Welcome!",
        "user": "Tree123"
    },
    {
        "text": "A correct dedcution. And I thank you for the appreciation to my joining.",
        "user": "Mr X"
    },
    {
        "text": "Welcome to the website.",
        "user": "SpikeyTike"
    },
    {
        "text": "X likes to be fancy and often doesn't talk much unless a puzzle is involved. But he's a real softie inside. ʕ •ᴥ• ʔ",
        "user": "Pinnipedia"
    },
    {
        "text": "I'll refrain from commenting that.",
        "user": "Mr X"
    },
    {
        "text": "I think I found something! The latest post has to be a puzzle!",
        "user": "icniVad"
    },
    {
        "text": "Let's analyze the clues.",
        "user": "icniVad"
    },
    {
        "text": "Please make a new chat if you're going to discuss any puzzles in particular.",
        "user": "Robot1311213"
    },
    {
        "text": "Now that just basically confirms my thoughts. See you all in the new chat!",
        "user": "icniVad"
    },
    {
        "text": "Robot, are you okay? I get the feeling that this poem is showing a side of you that we haven't seen before.",
        "user": "Pinnipedia"
    },
    {
        "text": "I agree with you on that. Think something went wrong with an update? My computer always acts a bit strange for days afterward.",
        "user": "DiggerTigger"
    },
    {
        "text": "Maybe some new language software should be considered.",
        "user": "SpikeyTike"
    },
    {
        "text": "I was never too much a fan of poems myself.",
        "user": "SpikeyTike"
    },
    {
        "text": "Well what do you think it signifies?",
        "user": "DiggerTigger"
    },
    {
        "text": "Poems can be nice. They can express the thoughts of the writer much deeper than regular texts if done well. (＾＾)",
        "user": "Pinnipedia"
    },
    {
        "text": "Poems usually have a hidden meaning, right?",
        "user": "DiggerTigger"
    },
    {
        "text": "You seem to know this stuff Pinnipedia, so could you tell us?",
        "user": "DiggerTigger"
    },
    {
        "text": "Hmm, maybe he's talking about how his day has been?",
        "user": "SpikeyTike"
    },
    {
        "text": "That's... not very deep?",
        "user": "DiggerTigger"
    },
    {
        "text": "I would consider it a message of how he has overcome recent difficulties and trying to better himself in some way.",
        "user": "Pinnipedia"
    },
    {
        "text": "Well excuse me for not being an expert on literature analysis.",
        "user": "SpikeyTike"
    },
    {
        "text": "I'm sure Pinnipedia is correct. Seems they know what they're talking about.",
        "user": "SpikeyTike"
    },
    {
        "text": "Yeah...",
        "user": "DiggerTigger"
    },
    {
        "text": "So, Pinnipedia. We haven't really heard much about you since you joined later than the others. Tell us a bit about yourself.",
        "user": "SpikeyTike"
    },
    {
        "text": "Not much to tell except what you already know. I'm sure we'll get to know each other eventually.",
        "user": "Pinnipedia"
    },
    {
        "text": "I'm glad everyone here likes to participate. Really gives the website some life with all the communications in the chat. Feels less like Fexjo and I are talking into the void. (⌒▽⌒)☆",
        "user": "Robot1311213"
    },
    {
        "text": "Maybe there are some lurkers who don't write? Your fandom might be huge!!!",
        "user": "DiggerTigger"
    },
    {
        "text": "I seriously doubt that. Not that the site is bad. Just not that good.",
        "user": "Tree123"
    },
    {
        "text": "Come out come out lurkers!",
        "user": "SpikeyTike"
    },
    {
        "text": "Wow, rude. It's pretty good in my opinion. And just keeps getting better!",
        "user": "SpikeyTike"
    },
    {
        "text": "You really think there are many lurkers?",
        "user": "Tree123"
    },
    {
        "text": "One never really knows right? And from my experience there's at least like 10 lurkers for every user. At least on sites I've used before.",
        "user": "SpikeyTike"
    },
    {
        "text": "That's a very specific number. I seriously doubt that without evidence.",
        "user": "Tree123"
    },
    {
        "text": "The trouble is that there is no evidence since the lurkers never reveal themselves. Some websites have numbers of how many visited the page though. And with that I've seen that a small minority actually participates in the content.",
        "user": "SpikeyTike"
    },
    {
        "text": "Well at least that's true.",
        "user": "Tree123"
    },
    {
        "text": "I'm just spitting facts here. Not even my sister is disputing me.",
        "user": "SpikeyTike"
    },
    {
        "text": "Just because I'm quiet doesn't mean I agree.",
        "user": "DiggerTigger"
    },
    {
        "text": "What's your counter-evidence then, huh? Prove me wrong!",
        "user": "SpikeyTike"
    },
    {
        "text": "You're really invested in this aren't you?",
        "user": "Pinnipedia"
    },
    {
        "text": "Okay I might have gotten a bit excited. But I still believe the arguments I'm making!",
        "user": "SpikeyTike"
    },
    {
        "text": "Let's just drop the subjevt and be happy that there will be more posts in the future?",
        "user": "DiggerTigger"
    },
    {
        "text": "Sounds good to me.",
        "user": "Pinnipedia"
    },
    {
        "text": "Alright, I guess.",
        "user": "SpikeyTike"
    },
    {
        "text": " I'm happy that we could settle this civilly.",
        "user": "Pinnipedia"
    },
    {
        "text": "Boats? That's nice. It's been to long since I travelled with one.",
        "user": "DiggerTigger"
    },
    {
        "text": "Right? I think last time was at least a few years ago.",
        "user": "SpikeyTike"
    },
    {
        "text": "And that's way too long",
        "user": "DiggerTigger"
    },
    {
        "text": "Did anyone else make any pies today? It's the optimal time. ٩(｡•́‿•̀｡)۶",
        "user": "Pinnipedia"
    },
    {
        "text": "Why?",
        "user": "DiggerTigger"
    },
    {
        "text": "Cause it's pie day!",
        "user": "Pinnipedia"
    },
    {
        "text": "Huh? I haven't heard of this before.",
        "user": "SpikeyTike"
    },
    {
        "text": "I guess it's pie for dinner then? Or maybe as dessert.",
        "user": "DiggerTigger"
    },
    {
        "text": "Whatever you feel like (^‿^)",
        "user": "Pinnipedia"
    },
    {
        "text": "Wait, I just googled it and this is because of the number PI? What connection does it even have to regular pies?",
        "user": "SpikeyTike"
    },
    {
        "text": "Just say them out loud.",
        "user": "DiggerTigger"
    },
    {
        "text": "It's just a fun thing, don't sweat the small stuff. ( ･ิ ͜ʖ ･ิ)",
        "user": "Pinnipedia"
    },
    {
        "text": "I'm a little confused but alright. I haven't had a pie in ages anyways. What would you like oh sister of mine?",
        "user": "SpikeyTike"
    },
    {
        "text": "Chocolate pies! Or lemon pies! Or even better, both!",
        "user": "DiggerTigger"
    },
    {
        "text": "No problemo. I'll get some on the way when I'm coming over today.",
        "user": "SpikeyTike"
    },
    {
        "text": "Yummy. Thanks!",
        "user": "DiggerTigger"
    },
    {
        "text": "A new design. Nice!",
        "user": "Tree123"
    },
    {
        "text": "It's looking great!",
        "user": "Pinnipedia"
    },
    {
        "text": "I like the colours",
        "user": "DiggerTigger"
    },
    {
        "text": "I like the new ways the posts are displayed. Nice new design.",
        "user": "SpikeyTike"
    },
    {
        "text": "Right? But what's with the post today? It's strange",
        "user": "DiggerTigger"
    },
    {
        "text": "It is obviously a puzzle. I created a new chat room, as is proper, and everyone is free to join.",
        "user": "Mr X"
    },
    {
        "text": "Well I won't join.",
        "user": "DiggerTigger"
    },
    {
        "text": "We'll just stay around here as per usual. Much less frustrating from what I've noticed reading through the puzzle chats.",
        "user": "SpikeyTike"
    },
    {
        "text": "Yup",
        "user": "DiggerTigger"
    },
    {
        "text": "Let's continue the discussion here!",
        "user": "Daemonosaurus"
    },
    {
        "text": "Still on the side of baby seals. And I haven't heard any arguments against it. ヾ(￣ー￣(≧ω≦*)ゝ",
        "user": "Pinnipedia"
    },
    {
        "text": "Wait, what? What are we talking about?",
        "user": "SpikeyTike"
    },
    {
        "text": "And who are you?",
        "user": "DiggerTigger"
    },
    {
        "text": "I would like one with some energy to them.",
        "user": "Daemonosaurus"
    },
    {
        "text": "Wait, yes! We have a new person here.",
        "user": "SpikeyTike"
    },
    {
        "text": "and the problem with seals is that they only live in water",
        "user": "Daemonosaurus"
    },
    {
        "text": "To be fair some dinosaurs also only live in water.",
        "user": "icniVad"
    },
    {
        "text": "Hello? Are my messages not going through?",
        "user": "SpikeyTike"
    },
    {
        "text": "Best of both worlds with that case in my opinion.",
        "user": "Robot1311213"
    },
    {
        "text": "Okay something has to be wrong on my side...",
        "user": "SpikeyTike"
    },
    {
        "text": "I can read your messages?",
        "user": "DiggerTigger"
    },
    {
        "text": "Nothings wrong Tike. They're just heavily involved in their discussion.",
        "user": "Pinnipedia"
    },
    {
        "text": "Phew, got scared for a minute there.",
        "user": "SpikeyTike"
    },
    {
        "text": "But you can't take creatures living in the water out for walks. And it will probably require a lot of space.",
        "user": "Daemonosaurus"
    },
    {
        "text": "So worth it though. Just look at their cute little bodies.",
        "user": "Pinnipedia"
    },
    {
        "text": "Maybe you should become a zoo keeper?",
        "user": "Daemonosaurus"
    },
    {
        "text": "That's way too much work though. And a bunch of other animals that wouldn't be as cute /╲/\\╭(ರರ⌓ರರ)╮/\\╱\\",
        "user": "Pinnipedia"
    },
    {
        "text": "Spider!!!",
        "user": "DiggerTigger"
    },
    {
        "text": "What in gods name is that!?",
        "user": "SpikeyTike"
    },
    {
        "text": "I'm out of here",
        "user": "DiggerTigger"
    },
    {
        "text": "And that just proves my point.",
        "user": "Pinnipedia"
    },
    {
        "text": "I'm coming right along! Peace.",
        "user": "SpikeyTike"
    },
    {
        "text": "That's also true.",
        "user": "Daemonosaurus"
    },
    {
        "text": "AHA! Another puzzle. Let me just create a chat room.",
        "user": "icniVad"
    },
    {
        "text": "Okay it's been a few hours and no one joined the room. I also haven't gotten any closer to solving it. Anyone there?",
        "user": "icniVad"
    },
    {
        "text": "I guess no ones online right now.",
        "user": "icniVad"
    },
    {
        "text": "Did you not note the date before going out yesterday?",
        "user": "Mr X"
    },
    {
        "text": "The first of april. But so what! It could still lead somewhere. There's no guarantee that Robot didn't do a double bluff or perhaps didn't think about the date. I'm determined to figure this out!",
        "user": "icniVad" 
    },
    {
        "text": "I've been elaborating a bit on my thought process in the chat room. Robot hasn't responded yet but i'm sure i'm onto something.",
        "user": "icniVad"
    },
    {
        "text": "I remain highly sceptical",
        "user": "Mr X"
    },
    {
        "text": "That's what I call a non-believer.",
        "user": "icniVad"
    },
    {
        "text": "Well, I certainly told you so.",
        "user": "Mr X"
    },
    {
        "text": "Ahem, don't know what you're talking about.",
        "user": "icniVad"
    },
    {
        "text": "Can't help but notice that a certain chat room is missing.",
        "user": "Pinnipedia"
    },
    {
        "text": "Alright, alright, I was wrong. Jeez, this was a bit embarrassing. Things happen you know? No need to pay it too much attention.",
        "user": "icniVad"
    },
    {
        "text": "(¬‿¬ )",
        "user": "Pinnipedia"
    },
    {
        "text": "There are times when your enthusiasm will pay off. But not today.",
        "user": "Mr X"
    },
    {
        "text": "One day.",
        "user": "icniVad"
    },
    {
        "text": "So Fexjo's vacation had me thinking. Where is your dream destination for a trip?",
        "user": "DiggerTigger"
    },
    {
        "text": "I would like to go to Egypt some day. See the pyramids and all that.",
        "user": "SpikeyTike"
    },
    {
        "text": "Rocks? I would like to go to Japan or Korea to see a completely different culture",
        "user": "DiggerTigger"
    },
    {
        "text": "Maybe the Arctic or Antarctica. Would be interesting to see a completely different environment.",
        "user": "Pinnipedia"
    },
    {
        "text": "I thought you would prioritze seals. But as for me, a trip somewhere not as popular would be nice. A city that has a things to do, but is not filled with tourists.",
        "user": "Tree123"
    },
    {
        "text": "Ah, but where can seals be found?(^.~)☆",
        "user": "Pinnipedia"
    }
]