{
    "userPicture1": "Robot1311213.png",
    "userPicture2": "Caesar.png",
    "username1": "Robot1311213",
    "username2": "Fexjo",
    "quoteTime": 30,
    "iframeList": [ "https://www.jigsawexplorer.com/online-jigsaw-puzzle-player.html?url=aHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL1NhcmE5OTc0L0FSR1BpY3R1cmVzL21hc3Rlci9TdW5zZXRQb29sLmpwZw~~",
                    "https://www.jigsawexplorer.com/online-jigsaw-puzzle-player.html?url=aHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL1NhcmE5OTc0L0FSR1BpY3R1cmVzL21hc3Rlci9VbWJyZWxsYXMuanBn",
                    "https://www.jigsawexplorer.com/online-jigsaw-puzzle-player.html?url=aHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL1NhcmE5OTc0L0FSR1BpY3R1cmVzL21hc3Rlci9BbGhhbWJyYVBvb2wuanBn",
                    "https://www.jigsawexplorer.com/online-jigsaw-puzzle-player.html?url=aHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL1NhcmE5OTc0L0FSR1BpY3R1cmVzL21hc3Rlci9DYXRSZXN0aW5nT25DaGFpci5qcGc~",
                    "https://www.jigsawexplorer.com/online-jigsaw-puzzle-player.html?url=aHR0cHM6Ly9naXRodWIuY29tL1NhcmE5OTc0L0FSR1BpY3R1cmVzL2Jsb2IvbWFzdGVyL05hdHVyZVN3ZWRlbi5wbmc_cmF3PXRydWU~", 
                    "https://www.jigsawexplorer.com/online-jigsaw-puzzle-player.html?url=aHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL1NhcmE5OTc0L0FSR1BpY3R1cmVzL21hc3Rlci9Cb2F0LmpwZw~~",
                    "https://www.jigsawexplorer.com/online-jigsaw-puzzle-player.html?url=aHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL1NhcmE5OTc0L0FSR1BpY3R1cmVzL21hc3Rlci9HVVNpZ24uanBn",
                    "https://www.jigsawexplorer.com/online-jigsaw-puzzle-player.html?url=aHR0cHM6Ly9yYXcuZ2l0aHVidXNlcmNvbnRlbnQuY29tL1NhcmE5OTc0L0FSR1BpY3R1cmVzL21hc3Rlci9CYWJ5RGluby5wbmc~"],
    "answerToBeEncrypted": "http://ThisWillBeAWebSiteAddress.later",
    "encryptionKey": [["m", 11],["d", 28], ["o", 57], ["a", 80]],
    "clueDate": "80A",
    "letterFont": "Monaco",
    "letterColour": "rgb(0,0,70)",
    "courseCode1": "tda",
    "courseCode1Index": 2,
    "courseCode2": "eda",
    "courseCode2Index": 1,
    "courseCode3": "dat",
    "listForCourseCode3": ["Aardonyx", "Achelousaurus", "Amygdalodon", "Bambiraptor", "Barosaurus", "Baryonyx", "Camarasaurus",
                            "Chasmosaurus", "Citipati", "Datanlong", "Diplodocus", "Dryosaurus", "Edmontonia", "Eoraptor", "Erketu",
                            "Fabrosaurus", "Fukuiraptor", "Fukuisaurus", "Gastonia", "Gobisaurus", "Graciliceratops", "Harpymimus",
                            "Hesperosaurus", "Hypsilophodon", "Iguanodon", "Irritator", "Isisaurus", "Jaxartosaurus", "Jobaria", 
                            "Juravenator", "Kentrosaurus", "Khaan", "Kritosaurus", "Leptoceratops", "Liliensternus", "Lurdusaurus",
                            "Magnosaurus", "Mahakala", "Marmarospondylus", "Naashoibitosaurus", "Neosodon", "Notohypsilophodon",
                            "Ohmdenosaurus", "Oksoko", "Overoraptor", "Panguraptor", "Pandoravenator", "Phyllodon",
                            "Qijianglong", "Qianzhousaurus", "Quilmesaurus", "Regaliceratops", "Rinchenia", "Ruyangosaurus",
                            "Sanxiasaurus", "Saturnalia", "Scipionyx", "Talarurus", "Taohelong", "Thanos", "Unenlagia", "Utahraptor", 
                            "Ultrasaurus", "Velociraptor", "Vulcanodon", "Vahiny", "Weewarrasaurus", "Wamweracaudia", "Wulong",
                            "Xenoposeidon", "Xixianykus", "Xuanhanosaurus", "Yandusaurus", "Yinlong", "Yutyrannus", "Zby",
                            "Zuul", "Zhongjianosaurus"],
    "hintDinosaurs": "I wonder why only two dinosaurs are capitalized? Maybe you can find another one that's capitalized as well?",
    "hintCourses": "See if you can build some other course codes from pieces you find here and there. I'm sure you'll find something interesting on their canvas course pages.",
    "redHintPicture": [1, ["Duros.jpg", "DurosRed.jpg"]],
    "blueHintPicture": [0, ["Ichthyosaurus.png", "IchthyosaurusBlue.png"]],
    "greenHintPicture": [0, ["Computer.png", "ComputerGreen.png"]],
    "jigsawSudoku": "Puzzle.png",
    "parkEntrance": "ParkEntrance.png",
    "directions": "20 34N, 25 150SE, 115 71E, 88 336NW, 72 354N, 35 53NE, 60 6N, 60 310NW, 55 33NE, 80 14N, 24 73E, 125 116SE, 62 84E, 112 16N, 155 18N, 30 260W, 34 303NW, 73 280W, 227 104E, 110 351N, 5 38NE, 25 155SE, F23",
    "chatAddress": "http://localhost:3001/",
    "postsPerPage": 5,
    "tabNames": ["Home", "Posts", "Chat", "Quotes", "About", "478", "071085", "Triceratops"],
    "memoryCards": [{"text": "Responsible for the GU's environmental management work","tag": 1},{"text": "Gothenburg Centre for Sustainable Development (GMV)","tag": 1},
                    {"text": "Exchange student housing","tag": 2},{"text": "Erasmus and Linnaeus Palme programmes","tag": 2},
                    {"text": "Courses","tag": 3},{"text": "Taken sequentially","tag": 3},
                    {"text": "Amount of libraries at GU","tag": 4},{"text": "8","tag": 4},
                    {"text": "Reception of the first few weeks","tag": 5},{"text": "Mottagningen","tag": 5},
                    {"text": "Animal testing","tag": 6},{"text": "Avoided at GU","tag": 6},
                    {"text": "University of Gothenburg","tag": 7},{"text": "GU","tag": 7},
                    {"text": "Place to create interesting games and augment reality","tag": 8},{"text": "Game Design & Technology Master's Programme","tag": 8}],
    "initialLives": 6,
    "currentQuestion": 1,
    "textPuzzles": ["In order to realize the University of Gothenburg's vision for sustainable development, Gothenburg Centre for Sustainable Development (GCSD) has been commissioned to create and facilitate cooperation with an aim to generate and practically implement knowledge about sustainable development. In order to develop solutions, GCSD brings academic disciplines together to create new knowledge. To this end, GCSD creates meeting places and brings together different types of expertise to promote sustainable development within research, education and cooperation, such as the Research Network for Sustainable Development.",
                    "During the third to fifth week, the students' unions arrange welcome week and orientation activities. In Swedish, these events are often referred to as nollning or inspark. These provide an introduction to student life for new students at the University of Gothenburg and can take the form of different planned activities. These can include games, sports, parties, dinners among others. There are often activities both with and without alcohol. Information about activities for new students is usually available on the websites of the students' unions, on social media and on notice boards around campus.",
                    "What is the situation on the Swedish labour market? What is the outlook within your profession or field? It is good to acquire knowledge about these things while studying. You can search the listings on the Swedish Public Employment Service's website and create a profile for yourself that allows employers looking for new employees to find you. Every year The Labour Market Tendency Survey is published, which describes the labour market and outlook for the coming 1-3 years for about 50 educational groups, most of which are university programmes. The survey has been conducted by Statistics Sweden (SCB) each autumn since 1959. It's also a good idea to use services like LinkedIn to be able to research what alumni from your programme or field work with now.",
                    "Our 13 libraries offer study environments with large reading rooms, individual study places, computers and group rooms.",
                    "In many countries, it is common to take several courses in sequential order for the entire semester. At the University of Gothenburg, it is most common to take courses in parallel, i.e., multiple courses simultaneously during the semester.", 
                    "The University of Gothenburg offers student rooms and apartments to exchange students within the Nordplus and INK programmes, as well as to exchange students that come as part of a bilateral agreement. Please note that you have to be nominated by your home university before applying. As an exchange student, you apply for housing as part of your application for exchange studies at the University of Gothenburg. In the application, just state that you would like to apply for student housing, and we will get back to you about the outcome. If you are allocated a student accommodation, we will send instructions, including a code, for how to proceed to be able to register/continue the process at SGS/UGOT. Please note that you should not register at SGS before that since you will then be listed in the queue for all other students.",
                    "More or less all projects involving research on humans and falling under the Ethical Review Act (Etikprövningslagen EPL, SFS 2003:460) require an ethical review by the Swedish Ethical Review Authority(Etikprövningsmyndigheten, EPM).\n A large proportion of medical research is conducted in test tubes or by using cell cultures. Animal testing is often performed in lieu of human testing. There are many studies that require animal testing and which can give us better diagnosis and treatment of diseases such as cancer, diabetes, Parkin's and stroke.",
                    "The Ethics Committee\nThe task of the committee is to support researchers and management in matters that concern research ethics, such as legislation, regulations, guidelines, ethics, health, and the environment. It was set up by the vice-chancellor in March 2021. The committee handles suspected deviations from good research practice that cannot be deemed research misconduct. The committee's secretary is Björn Rydevik, Ethics Administrator at the Grants and Innovation Office. He can answer questions concerning ethical reviews, good practice, requirements from research funders and research partnerships."]
}