[
    {
        "quote": "The way to get started is to quit talking and begin doing.", 
        "saidBy": "Walt Disney"
    },
    {
        "quote": "The greatest glory in living lies not in never falling, but in rising every time we fall.", 
        "saidBy": "Nelson Mandela"
    },
    {
        "quote": "If life were predictable it would cease to be life, and be without flavor.", 
        "saidBy": "Eleanor Roosevelt"
    },
    {
        "quote": "Life is what happens when you're busy making other plans.", 
        "saidBy": "John Lennon"
    },
    {
        "quote": "When you reach the end of your rope, tie a knot in it and hang on.", 
        "saidBy": "Franklin D. Roosevelt"
    },
    {
        "quote": "Always remember that you are absolutely unique. Just like everyone else.", 
        "saidBy": "Margaret Mead"
    },
    {
        "quote": "Tell me and I forget. Teach me and I remember. Involve me and I learn.", 
        "saidBy": "Benjamin Franklin"
    },
    {
        "quote": "Whoever is happy will make others happy too.", 
        "saidBy": "Anne Frank"
    },
    {
        "quote": "The only impossible journey is the one you never begin.", 
        "saidBy": "Tony Robbins"
    },
    {
        "quote": "Never let the fear of striking out keep you from playing the game.", 
        "saidBy": "Babe Ruth"
    },
    {
        "quote": "You have brains in your head. You have feet in your shoes. You can steer yourself any direction you choose.", 
        "saidBy": "Dr. Seuss"
    },
    {
        "quote": "The only limit to our realization of tomorrow will be our doubts of today.", 
        "saidBy": "Franklin D. Roosevelt"
    },
    {
        "quote": "It is better to fail in originality than to succeed in imitation.", 
        "saidBy": "Herman Melville"
    },
    {
        "quote": "If you really look closely, most overnight successes took a long time.", 
        "saidBy": "Steve Jobs"
    },
    {
        "quote": "Don't be afraid to give up the good to go for the great.", 
        "saidBy": "John D. Rockefeller"
    },
    {
        "quote": "You know you are on the road to success if you would do your job and not be paid for it.", 
        "saidBy": "Oprah Winfrey"
    },
    {
        "quote": "The only place where success comes before work is in the dictionary.", 
        "saidBy": "Vidal Sassoon"
    },
    {
        "quote": "You miss 100% of the shots you don't take.", 
        "saidBy": "Wayne Gretzky"
    },
    {
        "quote": "An unexamined life is not worth living.", 
        "saidBy": "Socrates"
    },
    {
        "quote": "You may be disappointed if you fail, but you are doomed if you don't try.", 
        "saidBy": "Beverly Sills"
    },
    {
        "quote": "Nothing is impossible, the word itself says, 'I'm possible!'", 
        "saidBy": "Audrey Hepburn"
    },
    {
        "quote": "I didn't fail the test. I just found 100 ways to do it wrong.", 
        "saidBy": "Benjamin Franklin"
    },
    {
        "quote": "Dreaming, after all, is a form of planning.", 
        "saidBy": "Gloria Steinem"
    },
    {
        "quote": "Whatever the mind of man can conceive and believe, it can achieve.", 
        "saidBy": "Napoleon Hill"
    },
    {
        "quote": "After all, one can't complain. I have my friends.", 
        "saidBy": "Eeyore"
    },
    {
        "quote": "The things that make me different are the things that make me, me.", 
        "saidBy": "Piglet"
    },
    {
        "quote": "Sometimes the smallest things take up the most room in your heart.", 
        "saidBy": "Winnie the Pooh"
    },
    {
        "quote": "A little consideration, a little thought for others, makes all the difference.", 
        "saidBy": "Eeyore"
    },
    {
        "quote": "It is more fun to talk with someone who doesn't use long, difficult words but rather short, easy words like, 'What about lunch?'", 
        "saidBy": "Winnie the Pooh"
    },
    {
        "quote": "It never hurts to keep looking for sunshine.", 
        "saidBy": "Eeyore"
    },
    {
        "quote": "Rivers know this: There is no hurry. We shall get there some day.", 
        "saidBy": "Winnie the Pooh"
    },
    {
        "quote": "When you go after honey with a balloon, the great thing is to not let the bees know you're coming.", 
        "saidBy": "Winnie the Pooh"
    },
    {
        "quote": "Don't underestimate the value of Doing Nothing, of just going along, listening to all the things you can't hear, and not bothering.", 
        "saidBy": "Winnie the Pooh"
    },
    {
        "quote": "I'm not lost for I know where I am. But however, where I am may be lost.", 
        "saidBy": "Winnie the Pooh"
    },
    {
        "quote": "They're funny things, Accidents. You never have them till you're having them.", 
        "saidBy": "Eeyore"
    },    
    {
        "quote": "If the string breaks, then we try another piece of string.", 
        "saidBy": "Owl"
    },
    {
        "quote": "Could be worse. Not sure how, but it could be.", 
        "saidBy": "Eeyore"
    },
    {
        "quote": "Yesterday, when it was tomorrow, it was too exciting a day for me.", 
        "saidBy": "Winnie the Pooh"
    },
    {
        "quote": "Physics is, hopefully, simple. Physicists are not.", 
        "saidBy": "Edward Teller"
    },
    {
        "quote": "Physics tells us observations can't be predicted absolutely. Rather, there's a range of possible observations each with a different probability.", 
        "saidBy": "Robert Lanza"
    },
    {
        "quote": "In the beginning there was nothing, which exploded.", 
        "saidBy": "Terry Pratchett"
    },
    {
        "quote": "Physics investigates the essential nature of the world, and biology describes a local bump. Psychology, human psychology, describes a bump on the bump.", 
        "saidBy": "Willard Van Orman Quine"
    },
    {
        "quote": "In physics, to be in two places at the same time would be a miracle; in politics it seems not merely normal, but natural.", 
        "saidBy": "Charles Edison"
    },
    {
        "quote": "Only two things are infinite, the universe and human stupidity, and I'm not sure about the former.",
        "saidBy": "Albert Einstein"
    },
    {
        "quote": "Everything we call real is made of things that cannot be regarded as real.", 
        "saidBy": "Niels Bohr"
    },
    {
        "quote": "Measure what can be measured, and make measureable what cannot be measured.", 
        "saidBy": "Galileo Galilei"
    },
    {
        "quote": "It would be better for the true physics if there were no mathematicians on earth.", 
        "saidBy": "Daniel Bernoulli"
    },
    {
        "quote": "For us physicists believe the separation between past, present, and future is only an illusion, although a convincing one.", 
        "saidBy": "Albert Einstein"
    },
    {
        "quote": "It is the nature of physics to hear the loudest of mouths over the most comprehensive ones.", 
        "saidBy": "Criss Jami"
    },
    {
        "quote": "Physics is really nothing more than a search for ultimate simplicity, but so far all we have is a kind of elegant messiness.", 
        "saidBy": "Bill Bryson"
    },
    {
        "quote": "Physics is about questioning, studying, probing nature. You probe, and, if you're lucky, you get strange clues.", 
        "saidBy": "Lene Hau"
    },
    {
        "quote": "If all of mathematics disappeared, physics would be set back by exactly one week.", 
        "saidBy": "Richard P. Feynman"
    },
    {
        "quote": "If the business of physics is ever finished, the world will be a much less interesting place in which to live.", 
        "saidBy": "John Gribbin"
    },
    {
        "quote": "The important thing is not to stop questioning. Curiosity has its own reason for existence. One cannot help but be in awe when he contemplates the mysteries of eternity, of life, of the marvelous structure of reality. It is enough if one tries merely to comprehend a little of this mystery each day.", 
        "saidBy": "Albert Einstein"
    },
    {
        "quote": "Physics is mathematical not because we know so much about the physical world, but because we know so little; it is only its mathematical properties that we can discover.", 
        "saidBy": "Bertrand Russell"
    },
    {
        "quote": "Give me a place to stand, a lever long enough and a fulcrum. and I can move the earth", 
        "saidBy": "Archimedes"
    },
    {
        "quote": "In physics, you don't have to go around making trouble for yourself nature does it for you.", 
        "saidBy": "Frank Wilczek"
    },
    {
        "quote": "Physics depends on a universe infinitely centred on an equals sign.", 
        "saidBy": "Mark Z. Danielewski"
    },
    {
        "quote": "There is no problem more difficult to solve than that created by ourselves.", 
        "saidBy": "Felix Alba-Juez"
    },
    {
        "quote": "Physics is the belief that a simple and consistent description of nature is possible.", 
        "saidBy": "Niels Bohr"
    },
    {
        "quote": "Dinosaurs may be extinct from the face of the planet, but they are alive and well in our imaginations.", 
        "saidBy": "Steve Miller"
    },
    {
        "quote": "If we measured success by longevity, then dinosaurs must rank as the number one success story in the history of land life.", 
        "saidBy": "Robert T. Bakker"
    },
    {
        "quote": "If history repeats itself, I am so getting a dinosaur.", 
        "saidBy": "Anonymous"
    },
    {
        "quote": "The most popular exhibits in any natural history museum are, without doubt, the dinosaurs. These creatures' popularity grows each year, partly because of the recent resurgence of dinosaur movies, but also because a skeleton of a full-sized tyrannosaurus rex still has the ability, even 65 million years after its death, to chill us to the bone.", 
        "saidBy": "Ray Harryhausen"
    },
    {
        "quote": "Scientists are complaining that the new Dinosaur movie shows dinosaurs with lemurs, who didn't evolve for another million years. They're afraid the movie will give kids a mistaken impression. What about the fact that the dinosaurs are singing and dancing?", 
        "saidBy": "Jay Leno"
    },
    {
        "quote": "Did not learned men, too, hold, till within the last twenty-five years, that a flying dragon was an impossible monster? And do we not now know that there are hundreds of them found fossil up and down the world? People call them Pterodactyles: but that is only because they are ashamed to call them flying dragons, after denying so long that flying dragons could exist.", 
        "saidBy": "Charles Kingsley"
    },
    {
        "quote": "The presence of feathers in tyrannosaurs and many other kinds of dinosaurs makes it very likely that the great T. rex was feathered, too. If the tyrant king was not fearsome enough already, just imagine it as an energetic, intelligent Big Bird from Hell.", 
        "saidBy": "Stephen Brusatte"
    },
    {
        "quote": "It is bad news to science museums when four in ten Americans believe humans lived with dinosaurs, and fewer than two in ten understand the terms 'molecule' and 'DNA.'", 
        "saidBy": "Larry Witham"
    },
    {
        "quote": "You're not allowed to call them dinosaurs any more.... It's speciesist. You have to call them pre-petroleum persons.", 
        "saidBy": "Terry Pratchett"
    },
    {
        "quote": "We're facing our end, like the dinosaurs millions of years before us. The only difference is we've got journalists on hand to document every blow and setback, cataloguing our rapid, painful downfall in vibrant, vicious detail. Personally, I think the dinosaurs had the better deal. When it comes to impending, unavoidable extinction, ignorance is bliss.", 
        "saidBy": "Darren Shan"
    },
    {
        "quote": "The dinosaur's eloquent lesson is that if some bigness is good, an overabundance of bigness is not necessarily better.", 
        "saidBy": "Eric Johnston"
    },
    {
        "quote": "Everybody thinks it's going to be different for them.... The dinosaurs thought so too.", 
        "saidBy": "Kathryn Davis"
    },
    {
        "quote": "The public image of dinosaurs is tainted by extinction. It's hard to accept dinosaurs as a success when they are all dead. But the fact of ultimate extinction should not make us overlook the absolutely unsurpassed role dinosaurs played in the history of life.", 
        "saidBy": "Robert T. Bakker"
    },
    {
        "quote": "We all have a dinosaur deep within us just trying to get out", 
        "saidBy": "Colin Mochrie"
    },
    {
        "quote": "Anyone who uses arithmetic methods to produce random numbers is in a state of sin.", 
        "saidBy": "John von Neumann"
    },
    {
        "quote": "There's no point in being grown up if you can't be childish sometimes.",
        "saidBy": "Dr. Who"
    },
    {
        "quote": "I hate grapefruit.",
        "saidBy": "Robot1312113"
    },
    {
        "quote": "No matter how many parabolas I calculate, I always seem to miss the basketball hoop.",
        "saidBy": "Fexjo"
    }
]