[
    {
        "date": [2022, 1, 5],
        "poster": "Robot1311213",
        "content": "Welcome to the blog Daily thoughts! You can read more about it on the About page, but basically it will just be me and my friend, Fexjo, writing about random things we think about during the day. We will check out the chat regularly, so please use it if you want to ask us something. Let's start writing, Fexjo! ＼(＾∀＾)メ(＾∀＾)ノ"
    },
    {
        "poster": "Fexjo",
        "content": "I had the thought that I should warn you ahead of time that Robot1311213 likes dinosaurs and puzzles. So you can expect to see a lot of that here."
    },
    {
        "date": [2022, 1, 7],
        "poster": "Robot1311213",
        "content": "Have you figured out what our usernames mean yet? I'll give you a hint for Fexjo. What is this?",
        "pictures": [["PostImages/Caesar.png", "Some nice salad."]],
        "puzzleNr": "B-c1",
        "comment": "This puzzle is solved in the chat."
    },
    {
        "poster": "Fexjo",
        "content": "As an exchange student I'm keen to learn interesting facts about Sweden. I've noticed some international aspects that I never really thought about but now realize are a staple of Sweden and it's culture. For one, we have the Nobel prize. The prestigious award that originated from Alfred Nobel who was, you guessed it, Swedish. I guess we can't go through this list without mentioning IKEA. A major furniture store that also sells some delicious meatballs. Although I did know that it came from Sweden I did not know the origin of the name. In fact, I just learnt that the other day. Turns out the founder's name is Ingvar Kamprad, which constitutes the first two letters, and he grew up on a farm named Elmtaryd near a village called Agunnaryd. Very interesting stuff, though I'm very happy that I don't have to pronounce any of those names. Spotify is apparently Swedish as well, which I had no idea of. For those who don't know Spotify is a service that provides music on your computer or your phone. Kind of like Apple Music but better. And yes, I use Apple products, though we certainly don't endorse any brands on this website. The famous clothing store H&M is apparently also Swedish, the more you know. And I've never seen so many Volvo's in my life in one place. Probably because it's the classic Swedish vehicle brand. Some other things worth a mention is Pirate Bay, Minecraft, and a bunch of pop music composing. Look up some of the famous pop songs and you'll be surprised with how many were done with the help of a Swede."
    },
    {
        "poster": "Robot1311213",
        "content": "Have you ever sort of sang in your bad no-one-can-hear-me-so-it-doesn't-matter-voice in the shower only to remember that you have guests? Then you know how I felt today. (－‸ლ)"
    },
    {
        "poster": "Robot1311213",
        "content": "Just a happy dinosaur to make your day better.",
        "pictures": [["PostImages/BabyDino.png", "Dino!!!"]]
    },
    {
        "poster": "Fexjo",
        "content": "Do you ever think about life on other planets? I certainly hope they, on whatever planet they may be, are not as destructive as we are."
    },
    {
        "poster": "Fexjo",
        "content": "I've been talking to some friends recently and it seems that most people have some sort of pet. Mostly cats and dogs but some have interesting ones like iguanas or hamsters. One even has a collection of spiders and another collects snakes. For my part, although a pet sounds appealing, I have my hands full taking care of Robot. I think an update to his operating system would be prudent soon."
    },
    {
        "poster": "Robot1311213",
        "content": "I just saw your post from yesterday Fexjo. Why are you being so mean? (ಡ‸ಡ) I mean, if anything, we're doing a cooperative effort here. I remember just two days ago when I had to take an hour-long trip to make sure that you had the right school books for your exercise session. (≖ ͜ʖ≖)"
    },
    {
        "poster": "Fexjo",
        "content": "The LMS (Learning Management System) that Gothenburg University uses is Canvas. It is quite straightforward and easy to log in to. Many times, the course book is available at the online library. It saves you both the money of buying it and the effort of carrying a thick book around!"
    },
    {
        "poster": "Fexjo",
        "content": "Many trams in Gothenburg have names on them and I have started collecting them. Every time I see a new name, I find out who they are and what they did and add them to my list. Let's see how many I can find before I leave Sweden!"
    },
    {
        "poster": "Robot1311213",
        "content": "Today I discovered something truly horrible, an injustice that can't be left untreated. Fexjo has been in Sweden for some time but he's never had Fika! Σ(°ロ°) Obviously I set out to fix this crime against nature as soon as I found out and he's now experienced the pinnacle of Swedish culture. My work here is done. (⌐■_■)"
    },
    {
        "poster": "Fexjo",
        "content": "My camera just got smashed after I stumbled and dropped it. Now I'm in the market for a new one. I only have one issue. Cameras are so expensive! It's been so long since I had to buy a new one that I had forgotten the price of quality. I might just have to stick to my guns and go with a cheaper alternative. I'm not made of money after all, especially not for what is, ultimately, just a hobby."
    },
    {
        "poster": "Robot1311213",
        "content": "I've been struggling to think of what to include on this website. It seems to me that weeks can pass before anything interesting happens. Thus I asked Fexjo what I should include and he told me to just write whatever comes to mind. So here goes: strain, salesperson, sigh, simplicity, sheet, substitute. Today my mind was focused on the letter S. I'm hoping for W tomorrow but we'll see."
    },
    {
        "poster": "Fexjo",
        "content": "I figured that we haven't really showed much presence for our schools of choice lately and just thought I'd leave this here. To commemorate all the good times we've had and will have in the future.",
        "pictures": [["PostImages/ChalmersLogo.png", "Chalmers logo in gold."], ["PostImages/GUBuilding.jpg", "An old building belonging to Gothenburg University"]]
    },
    {
        "poster": "Robot1312113",
        "content": "Today Fexjo told me that he had participated in a game night with SKIP, which is apparently some association at GU. I can't believe he would leave me behind like this. (⇀‸↼‶) They even played some of my favorite board games."
    },
    {
        "date": [2022, 2, 7],
        "poster": "Robot1311213",
        "content": "Gothenburg has this nice place that's not quite a zoo but somewhat close enough. It's called Universeum, I visited today. They have a bunch of animals and fish and all sorts of creatures. I especially like the rainforest section. The differences to a regular zoo comes from the fact that this is all inside one building. Nothing is left to the open sky, which is why they don't have Lions and Antelopes I assume. They also have some sections where you can play kids-friendly games and learn about the human body or learn about space. Definitely a recommendation to visit at least once if you're ever in Gothenburg.",
        "puzzleNr": "B-c2",
        "comment": "This puzzle is a helper post to puzzle B-c2"
    },
    {
        "poster": "Robot1311213",
        "content": "Did you know... \n \n ...the dinosaur with the longest name is Micropachycephalosaurus? \n ...it is speculated that dinosaurs could live for 200 years? \n ...Elasmosaurus is up to 14 meters long, but half of the length comes from it's neck? \n ...the first dinosaur to be named is the Megalosaurus in 1824? \n \n I know all this by heart. As well as many other things, as is only proper for an enthusiast.(￣^￣)ゞ"
    },
    {
        "poster": "Fexjo",
        "content": "How much memory do you think Robot1311213 has? And how much of it is used to store facts about dinosaurs?"
    },
    {
        "date": [2022, 2, 11],
        "poster": "Robot1311213",
        "content": "I composed a poem for everyone today. What do you think? \n \n At pleasant temperature, \n in contrast to how you would like life to be, \n an idea that seems perfect, \n held or fixed in position securely, \n a mistake. \n \n A place where you can buy drinks and simple meals, \n filled with a continuous humming sound, \n a particular variety or type, \n the process of gaining this, \n a victory.",
        "puzzleNr": "B-c2",
        "comment": "This puzzle is solved in the chat."
    },
    {
        "poster": "Fexjo",
        "content": "Recently, my collection of the names of trams have not gone well. I keep encountering those I already have."
    },
    {
        "poster": "Fexjo",
        "content": "Someone once told me that counting the brush strokes when brushing your teeth in the morning will wake you up. So I tried that today. It just made me brush slower so that my brain could catch up..."
    },
    {
        "poster": "Robot1311213",
        "content": "Music has been on my mind lately. I know most people have a preference for the genre, whether that be pop, rock, jazz, or something else. I'm personally not really partial to anything specific. I like good music, whatever the genre, as simply as that. What qualifies as good music though, that is always a difficult question to answer. It always seem to me that the music that qualifies as good is found in the weirdest places. It's not when I listen to the radio or just browsing the top hits. Instead it's when I'm walking through town and hear someone play something on a speaker randomly. Let me tell you, it makes it much harder to find out the names of the songs. (」＞＜)」"
    },
    {
        "poster": "Fexjo",
        "content": "I've been trying to look up some cooking recipes and tips. I feel like ever since I moved away from my parents I have been progressively getting worse with the food I eat. So I decided to try to learn some new recipes and get a more varied diet. I think it's been going pretty well, I even found out that frying pans get ruined when you use soap to wash them out. Who knew right? In other news I need to buy a new frying pan."
    },
    {
        "poster": "Robot1311213",
        "content": "Did you know that the telescope wasn't invented until roughly 300 years after glasses? (⊙_⊙) Both are lenses, so I expected it to be more similar. It is basically the same thing, after all."
    },
    {
        "poster": "Fexjo",
        "content": "Robot and I tried karaoke today. I think it's best to simply say, never again... (￢_￢;)"
    },
    {
        "date": [2022, 3, 2],
        "poster": "Fexjo",
        "content": "There hasn't been that many posts this past month and I'd just like to explain why that is. I could blame the fact that both Robot and I have been busy with school and not had much time for the website but that's not quite the whole truth. The fact is that we didn't really know what we wanted to do with the website and where it was supposed to go in the future. We were talking about maybe doing some changes or even scrapping the whole thing. It was quite difficult for us to consider but we felt that we had to honestly ask ourselves if this is something that we wanted to do. To not go on too long about this I'll just say that in the end we decided to keep doing what we do on this website. We do like to be able to express ourselves and we want to continue to be able to do that in a place we feel comfortable about. Not much will have changed for everyone reading this, except for a potential uprise in post frequency, but suffice to say that we feel better about continuing what we have done this far. I thought that the few people we have on this website and in the chat deserved to know about this."
    },
    {
        "poster": "Robot1311213",
        "content": "It has been quite some time since I taught you something new about dinosaurs so of course it is time for more (o^ ^o)/! \n \n The blue whale is larger than most dinosaurs ever were. I would really like to see one in real life. (←_←) \n The smallest dinosaur, the Baby Mussarus, would fit in a shopping bag. \n Dinousaurs dominated for 165 million years, while humans have been here for only 2 million. What a difference. \n \n Did you learn anything new from my pool of knowledge today?"
    },
    {
        "poster": "Fexjo",
        "content": "If you ever feel lost, just look at this sign I found at my university. It is trying to help, but somehow makes you feel all the more confused. It did work out in the end though, and I found the direction for my goal.",
        "pictures": [["PostImages/GUSign.jpg", "Sign with many provided directions."]]
    },
    {
        "poster": "Fexjo",
        "content": "I watched an old TED talk the other day about the sound of black holes. It was performed by a woman named Janna Levin in 2011 if anyone is interested in attending. To liken a black hole to a drum and to hear the sound and composition of objects existing in a noiseless vacuum, it's truly something I recommend other people take a gander at as well. Revisiting topics like this, even if they're a few years old now, is often an interesting and fascinating experience. Surmise to say, I think i'm going to go through a bunch of old TED talks over the coming week. It just struck me as in the mood."
    },
    {
        "poster": "Robot1311213",
        "content": "I rarely read books unless I really have to (except those about dinosaurs, of course!). But the other day, I found one introduciong more advanced physics in terms a layman would know. I thought I could give it a try to understand what Fexjo's talking about, but forgot to note down the title. And I can't find it again (￣ ￣|||)."
    },
    {
        "poster": "Fexjo",
        "content": "Some of my courses have been situated at Lindholmen campus. It's a place where both GU and Chalmers study at. I haven't really explored it much beyond the classrooms and such so I decided to walk around and take some pictures of some interesting things that I found there.",
        "pictures": [["PostImages/Birds.jpg", "Fake birds."],["PostImages/Kuggen.jpg", "A peculiar looking library named Kuggen."],["PostImages/FakeBoat.jpg", "A model boat."],["PostImages/RealBoat.jpg", "A boat parked outside Lindholmen campus."]]
    },
    {
        "poster": "Robot1311213",
        "content": "So I know I said I wanted to see a whale the other day to get an idea of the size dinosaurs have.  And how could I have missed this (⊙_⊙)! There is one, here in Gothenburg! Apparently, it washed up close to here in 1865 and can now be found in the natural history museum. I need to go and see it! ─=≡Σ((( つ＞＜)つ"
    },
    {
        "poster": "Fexjo",
        "content": "A common stereotype of students is that they are quite lazy. They come late to class, they don't do all the work assigned to them, and they constantly complain about everything they have to do. Thus, I feel justified in complaining about my latest essay assignment. It feels like I just ran a marathon, and not in a good way. On to better news though, highest grade in class. I'm still amazed with how fast the teacher grades the assignments in this course, I mean, it's barely been three hours. Simply incredible."
    },
    {
        "date": [2022, 3, 14],
        "poster": "Fexjo",
        "content": "I made an assortment of delicious pies today. Included amongst them are apple pies, blueberry pies, rhubarb pies, and a bunch more. It truly was quite a treat."
    },
    {
        "date": [2022, 3, 14],
        "poster": "Robot1311213",
        "content": "I think Fexjo went mad today. Out of nowhere he just suddenly spouted that he needed to make a bunch of pies. He then went on to create an entire buffet. Something has gotten into him, and I'm not quite sure what, or how I can fix him. ＼(〇_ｏ)／"
    },
    {
        "poster": "Robot1311213",
        "content": "You know, one of my friends is working part time as a programmer at a lesser known company. He has developed a routine of multiple cups of coffee a day from the extra hours he works on top of studying. He keeps telling me he is a staunch supporter of python code but I know that his heart lies with java. (￣ω￣)"
    },
    {
        "poster": "Fexjo",
        "content": "I'm sure that a lot of people are familiar with shower thoughts. Or at least the idea of them, they don't necessarily have to happen in the shower. They're just random thoughts that pop into your mind and when you think a bit deeper on them they make a lot of sense. Mine today was how people usually say to 'Sleep something off' which is equivalent to when Robot tells me to turn a device off and on again to solve the tech issue I'm having. The crazy thing is that most of the time this works for both my devices and humans."
    },
    {
        "poster": "Robot1311213",
        "content": "Did you feel that the website is a bit unfamiliar? Then you're right! We changed some design to make it easier to read things. And it looks quite a lot better than before if I do say so myself. <(￣︶￣)>"
    },
    {
        "date": [2022, 3, 19],
        "poster": "Robot1311213",
        "content": "So today I have a message for you all through the words of our betters. Can you figure it out? \n \n Kathryn Davis 3 \n Nelson Mandela 7 \n Dr. Who 12 \n Eleanor Roosevelt 8 \n Margaret Mead 9 \n Steve Miller 1, \n Jay Leno 20 \n John D Rockefeller 13! \n \n Good luck! (￣▽￣)ノ",
        "puzzleNr": "B-c3",
        "comment": "This is the main post to puzzle B-c3."
    },
    {
        "poster": "Robot1311213",
        "content": "Exam week is over!!! ヽ(*⌒▽⌒*)ﾉ"
    },
    {
        "date": [2022, 3, 21],
        "poster": "Fexjo",
        "content": "I remember last year around this time when we made a bunch of pancakes for Pancake Day. I wonder if Swedes celebrate Pancake day as well?"
    },
    {
        "poster": "Fexjo",
        "content": "So I asked around and apparently in Sweden they don't do pancakes for this holiday. They instead eat 'Semlor' which is a kind of bun with whipped cream and almond paste. Surprisingly good, though don't talk about it when in Sweden. For some people it's a very controversial topic. I got dragged into this large debate of the question if a semla is a sandwich. It then transitioned into if hamburgers are sandwiches and then all manner of food. I did actually get a bit too involved in the argument in the end. Though I don't think I should revisit that topic and open up that can of worms."
    },
    {
        "poster": "Fexjo",
        "content": "Both our resident robot and I have been feeling a bit cooped up inside for a while. And we haven't really done much together lately. So we decided to take a bit of a walk. Just enjoy the sights and explore parts of the city. Even living in Gothenburg for an entire lifetime will still leave many places unexplored. Not to mention that I've only been here for a year. We saw many beautiful sights on our exploration, though one stuck out to me. We came across this as we were wandering aimlessly along a cycling route. The route is called 'Kattegattsleden' for the avid cyclists that are interested. Apparently it stretches for 390 km, quite a distance to be sure. Back on topic though, the bridge is truly a marvel of engineering. Even I can tell that much without much knowledge in structural architecture. Could do with a paint job but hey, I'm not in charge. ",
        "pictures": [["PostImages/Kattegattleden.jpg", "Massive bridge by cycling route."]]
    },

    {
        "poster": "Fexjo",
        "content": "Robot talked me into tasting 'fil' today. It's a dairy product, with a texture similar to yoghurt. I was a bit hesitant, as it is made by fermenting cow's milk which doesn't sound tasty at all. But it was not to bad. With some nice cereals, it could be a new addition to my breakfast table. As a side note, it is apparently a dairy product lactose intolerants can tolerate better than usual."
    },
    {
        "date": [2022, 3, 25],
        "poster": "Robot1311213",
        "content": "Today is waffle day! It is a thing that swedes do. We have days for all types of things. Pancake day, muffin day, burger day, fruit day, egg day, cinnamon bun day... The list is really long. Anyway, it menas that I will get Fexjo to make som waffles today. The ones he makes are awesome (っ˘ڡ˘ς)."
    },
    {
        "poster": "Fexjo",
        "content": "Have you heard of the butterfly effect? Where a single flap of a butterfly's wings can cause a tornado in another part of the world. A cascading series of events that causes something huge from the tiniest of things. My teacher did not accept that excuse to why I was late this morning."
    },
    {
        "poster": "Fexjo",
        "content": "I've heard a lot of nice things about the 'Skärgård', the collection of islands outside Gothenburg. I would love to go on a boat trip and explore but it will probably have to wait for like a month for the weather to improve. I've been thinking about it for a while now actually but now that it feels so close to proper spring I feel even more drawn to it. I'll definitely post something here if the trip ever takes place."
    },
    {
        "date": [2022, 4, 1],
        "poster": "Robot1311213",
        "content": "It's a new month and what better way to celebrate than with a puzzle! \n Here's a little something to get you started: ndXiONetoDWWcrLS",
        "secret": "AReallyLongPasswordToMakeItHardToFigureOutAndDinosaursAreTheBest!",
        "secretContent": "If you really figured this out on your own, I'm impressed. You were not supposed to."
    },
    {
        "date": [2022, 4, 1],
        "poster": "Fexjo",
        "content": "I'm quite excited for tomorrow. I'm going for a two week-long vacation to Spain. I bet it's going to be loads of fun."
    },
    {
        "poster": "Fexjo",
        "content": "I was going to listen to some music and maybe an audiobook on the flight today. Only once we were in the air did I notice that it hadn't downloaded. It turned out to be quite a long trip after that.",
        "pictures": [["PostImages/PlaneWing.jpg", "A plane wing."]]
    },
    
    {
        "date": [2022, 4, 4],
        "poster": "Robot1311213",
        "content": "WIP: April Fools cont"
    },
    {
        "poster": "Fexjo",
        "content": "One of the first things I noticed when arriving at my place of residence was that there were a lot of cats in the area. They are surprisingly friendly, walking up to strangers and begging for pets, no fear in them whatsoever. One of the cats even decided to inhabit my place and adopt himself through me while I'm here. I don't have the heart to shoo him away so I guess I temporarily own a cat now. It's going to be an interesting experience.",
        "pictures": [["PostImages/CatRestingOnChair.jpg", "Cat resting on chair."],["PostImages/WhiteCat.jpg", "A white cat."],["PostImages/SnoozeCat.jpg", "A snoozing cat."],["PostImages/CatLickingHimself.jpg", "A cat licking his fur."]]
    },
    {
        "poster": "Fexjo",
        "content": "I've noticed that I'm probably going to be uploading a bunch of images while I'm away on this trip. There's just too much to show. There's also the fact that I can do it quite quickly and can focus on the vacation for most of the time instead of writing content here. So expect me to not be writing as much until I'm back. To keep up with that theme, here are some more images.",
        "pictures": [["PostImages/AlhambraPool.jpg", "Reflecting pool at Alhambra."],["PostImages/OrangePlant.jpg", "An orange plant."],["PostImages/Staircase.jpg", "Some stairs outside."],["PostImages/Dolphin.jpg", "A dolphin."]]
    },
    {
        "poster": "Fexjo",
        "content": "Have you read the book 'A Short History of Nearly Everything'? There's a suprising amount of things you can learn when reading a book on the beach. A lot of odd things in particular when it comes to this book. One thing did make me feel quite special: \n \n 'Not one of your pertinent ancestors was squashed, devoured, drowned, starved, stranded, stuck fast, untimely wounded, or otherwise deflected from its life's quest of delivering a tiny charge of genetic material to the right partner at the right moment in order to perpetuate the only possible sequence of hereditary combinations that could result -- eventually, astoundingly, and all too briefly -- in you.' \n \n This as well is just way to true: \n \n 'There are three stages in scientific discovery. First, people deny that it is true, then they deny that it is important; finally they credit the wrong person.'"
    },
    {
        "poster": "Fexjo",
        "content": "Just thought I should share some more cool pictures of Spain while I'm here. I don't get this chance often.",
        "pictures": [["PostImages/OceanView.jpg", "A view of the ocean."],["PostImages/WhiteHouses.jpg", "Some white houses on a hill."],["PostImages/Umbrellas.jpg", "A bunch of floating umbrellas."],["PostImages/ColorfulBuilding.jpg", "A colorful building."]]
    },
    {
        "poster": "Fexjo",
        "content": "There is a lot of beautiful plantlife in this climate that I don't see much of usually. Just walking along and enjoying the scenery and beauty of nature is surprisingly calming and relaxing. Taking some time to cool off and just shift your worries away gives quite a lot of peace in the moment. Though don't do it too long, I've had a bunch of procrastination sessions start that way.",
        "pictures": [["PostImages/PalmTree.jpg", "A palm tree."],["PostImages/RedTree.jpg", "A tree with red flowers."],["PostImages/TreeRoots.jpg", "A tree with long roots."],["PostImages/GrapeVine.jpg", "A hanging plant."]]
    },
    {
        "date": [2022, 4, 10],
        "poster": "Robot1311213",
        "content": "I borrowed some pictures from Fexjo to make these. What do you think all of it adds up to?",
        "pictures": [["Puzzles/Skyline1.jpg", "A skyline."], ["Puzzles/Skyline2.png", "A skyline"],  ["Puzzles/Skyline3.jpg", "A skyline"], ["Puzzles/Shapes.png", "Two rectangles and a triangle."],  ["Puzzles/Lines.png", "Four underscores in different colours. Three with signs."], ["Puzzles/Signs.png", "Four underscores with minus and then two plus signs between them."] ],
        "puzzleNr": "B-p2",
        "comment": "This is the main post to puzzle B-p2."
    },
    {
        "poster": "Robot1311213",
        "content": "I entered a hacker competition last week and today was finally the day to perform. <(￣︶￣)> Honestly, kind of disappointed in the kind of tests and work we had to do. It's not something I could see being of actual use in a real situation. ┐(￣ヘ￣;)┌ And i'm not just saying that because I lost. (」＞＜)」"
    },
    {
        "poster": "Fexjo",
        "content": "I need to give some credit to the place that I'm staying at. They have the most fantastic view. At the same time it really showcases the weather as well. I've included a picture of one of the few times that I saw a cloud in the sky during my time here.",
        "pictures": [["PostImages/LonelyCloud.jpg", "A single cloud in the sky."],["PostImages/ShadedPool.jpg", "Shaded view of pool."],["PostImages/ClearReflectingPool.jpg", "Clear blue sky and pool."],["PostImages/SunsetPool.jpg", "Pool with sunset."]]
    },
    {
        "date": [2022, 4, 16],
        "poster": "Fexjo",
        "content": "Today is the day that I returned to Sweden after my vacation. Nothing really interesting happened on the way back but I'm definitely missing the warmer weather already. I did some of the schoolwork remotely but it's been a very relaxing experience. It was a very good chance to reset myself as well. Now it's back to the grind, gotta do well in Uni so that I can get a nice job and be able to go on more of these kinds of vacations when I want to in the future."
    },
    {
        "poster": "Fexjo",
        "content": "It's Easter time around now and I've been buying some chickens and eggs for decoration. But it got me thinking about holidays in general. I'm more of a christmas guy myself but I do enjoy most holidays. I was asking some of my friends about their favorite holidays and some of them mentioned Midsummer. I didn't know this was a thing but apparently Swedish people dance around a giant green pole that's supposed to depict a phallus during the middle of summer. To each their own I guess. Though if history and details of holidays in general are discussed I'm sure that many similar elements will come up for the other holidays."
    },
    {
        "date": [2022, 4, 18],
        "poster": "Fexjo",
        "content": "It's now officially spring. The way to know that is the fact that minigolf opens up for customers. Seeing a prime opportunity and not willing to miss it, I took Robot out for a match. It was beautiful weather outside, warm enough to not have to bother with jackets or even sweatshirts. We played very evenly, sometimes there was just a difference of one hit between us and usually we had the exact same score. Robot did manage to do a hole-in-one though, which is always nice when it happens, though I do wish I could have had that as well. I did end up winning in the end, so I'm kind of happy for that at least.",
        "pictures": [["PostImages/Minigolf1.jpg", "A minigolf course."],["PostImages/Minigolf2.jpg", "A minigolf course."]]
    },
    {
        "poster": "Fexjo",
        "content": "This time of year I have convinced Robot to do some activities around Gothenburg. It's spring and beautiful weather. I want to enjoy it while it lasts. Just yesterday we played some minigolf, but that's just the start, we'll do a few more fun things before Robot starts digging his feet in the ground. Maybe he'll even find some of it fun."
    },
    {
        "poster": "Robot1311213",
        "content": "We visited the Natural History Museum in Gothenburg today. And what a blast it was! ＼(٥⁀▽⁀ )／ We got to see so many different specimens of birds, mammals, insects, and of course, dinosaurs. They had a lot of cool stuff to go through, they even had a hedge maze outside which we went through. I highly recommend going there for yourself. I made Fexjo take some images that I included here, can't let everyone else be remiss of some of the experience.",
        "pictures": [["PostImages/MuseumDino.jpg", "Skeleton of an Ichtyosaurus."],["PostImages/MuseumMaze.jpg", "A hedge maze."],["PostImages/MuseumSeal.jpg", "Statues of some seals."],["PostImages/MuseumWhale.jpg", "Skeleton of a whale."]]
    },
    {
        "poster": "Fexjo",
        "content": "I'm happy that Robot enjoyed the visit to the museum yesterday but enough's enough. He's starting pulling out random quotes or information about any creature we encounter through conversion or in person. I'ts kind of starting to annoy me. What's worse is that I know he's probably doing it so extensively on purpose just because he's seen how it riles me up."
    },
    {
        "date": [2022, 4, 22],
        "poster": "Fexjo",
        "content": "Today was quite a special treat. I have known for a while about the archipelago of islands surrounding Gothenburg and how beautiful they can be. Today was the day where the weather was nice enough and Robot had enough free time to show me around. And what a sight it was! We saw some beautiful views and encountered many interesting peculiarities. One of which was some sort of resting or camping site in the middle of the woods. We did spend most of the time along the coast though, there was a nice coastal trail to follow which really helped us navigate. Although Robot is a native he hasn't really been around the islands much himself. It was a wonderful time though and I've enclosed some images below to show some of the things we saw.",
        "pictures": [["PostImages/IslandDock.jpg", "A dock with boats."],["PostImages/IslandRocks.jpg", "A nice rocky view."],["PostImages/IslandView.jpg", "A nice sunny view."],["PostImages/IslandHuts.jpg", "Some huts in a forest."]]
    },
    {
        "poster": "Robot1311213",
        "content": "Yesterday Fexjo convinced me that we should go out to the archipelago. This did seem like a pretty fun idea but I don't know if I would do it again. I mean, the views were nice and all but some of the stuff really sealed the deal for me. For one we had to spend an hour on the bus to get there, and then a while more on the ferry over to the island itself. Then when we were there Fexjo had us walking along a trail all day. So much walking. (￣ ￣|||) Other than that I have to admit that it was quite a nice time. I even saw some interesting stuff on our meandering path to nowhere. They're below if anyone is interested.",
        "pictures": [["PostImages/IslandWindmill.jpg", "A windmill."],["PostImages/IslandAnchor.jpg", "An anchor and a ball on a rock."],["PostImages/IslandShip.jpg", "A yellow ship in the distance."],["PostImages/IslandDeer.jpg", "A deer."]]
    },
    {
        "poster": "Fexjo",
        "content": "Saw this nice-looking boat today. Somehow, it did not rain although the sky was grey all day.",
        "pictures": [["PostImages/Boat.jpg", "Picture of a boat."]]
    },
    {
        "poster": "Robot1311213",
        "content": "You ever experienced feeling like you fall and wake up with a start? Today, I also did that. Including the falling part. It hurt. (×_×#)"
    },
    {
        "poster": "Fexjo",
        "content": "I think Robot has finally decided to return to his inside life. We did get a lot of nice activities done before though so I'm very happy with that. I'd love to repeat some of them in the future and also to try some new things. And even if Robot may act otherwise, I know he enjoyed himself immensely as well. Just read his post of when we went to the natural history museum and you'll see his true feelings."
    },
    {
        "date": [2022, 4, 26],
        "poster": "Robot1311213",
        "content": "WIP: Robot birthday"
    },
    {
        "poster": "Fexjo",
        "content": "As Robot really likes puzzles and stuff, so I gave him one with a lot of pieces as a present. I think a puzzle with 5 000 pieces will keep him occupied for a while. There was one with 10 000 pieces as well, but the 5 000 pieces one look way more fun, so I went with that."
    },
    {
        "poster": "Robot1311213",
        "content": "We walked up and up and up and up to a lookout with view over Gothenburg today. It was a long way up in the warm weather but the view was awesome. You'll have to take my word for it though, as couldn't take any pictures to share because both our phones were out of battery ╮(︶︿︶)╭."
    },
    {
        "date": [2022, 4, 30],
        "poster": "Fexjo",
        "content": "WIP: Something about Valborg"
    },
    {
        "date": [2022, 5, 1],
        "poster": "Robot1311213",
        "content": "There's a bunch of interesting ciphers out there. The famous ones, like Caesar, Alberti, or Vigenère. But also some more obscure ones, like Phaistos, Voynich, or Bellaso. Personally, I favor variants of the famous ones. (￣▽￣)ノ Alberti is the most famous Cipher Disk as an example, but there's also so many more Cipher Disks out there. Take the Aeneas, which existed 5th century BC, way before Alberti! Σ(O_O) For some more modern alternatives we have the Union Cipher disk or the Mexican Army Wheel. This is such a fascinating topic, I could talk about them all day. I recommend checking out a physical cipher, something to play around with in your hands, it's very interactive and loads of fun. ヽ(o^ ^o)ﾉ",
        "puzzleNr": "B-p1",
        "comment": "This post is a helper post to puzzle B-p1"
    },
    {
        "date": [2022, 5, 3],
        "poster": "Robot1311213",
        "content": "Man, this latest course of mine, LMA017, was so fun. Way too little math for my taste though. I do like that all the courses I've gone to have a similar format, with three letters followed by three numbers. The similarity and symmetry is pleasing to me. (っ˘ω˘ς ) Though I do wonder where the format even originated.",
        "puzzleNr": "B-p1",
        "comment": "This post is helper post 2 to puzzle B-p1"
    },
    {
        "date": [2022, 5, 4],
        "poster": "Robot1311213",
        "content": "Today is the day to rewatch the old Star Wars movies. My favorite one is A New Hope, which I know isn't that original of me but I think the nostalgia is getting to me. (─‿‿─)"
    },
    {
        "poster": "Fexjo",
        "content": "I challeged myself to cook something I haven't done before today. It was a fairly complicated recipe. It turned out really tasty, but didn't really look like the picture. Is it just me, or do others also never get it to look like the version in the recipe?"
    },
    {
        "poster": "Robot1311213",
        "content": "When people tell me to learn R, they say I should familiarize myself with an entirely new programming language. When they tell a baby to learn R, they just want them to pronounce a letter correctly. Life is unfair. (╥﹏╥)"
    },
    {
        "poster": "Robot1311213",
        "content": "Fexjo made me jealous with his vacation in Spain, so I went on a trip! It was only during the weekend. And only to Stockholm, the capital of Sweden. So it was not much compared to Spain, but I had really fun. I took some friends with me and we explored all sorts of places none of us hade been to before."
    },
    {
        "poster": "Fexjo",
        "content": "I got a haircut today. It was a different experience compared to back home."
    },
    {
        "poster": "Robot1311213",
        "content": "Today, I have a simple query. (⌐■_■) Do you think dinosaurs were hot-blooded or cold-blooded? There are theories pointing toward either case so I would urge you to think about it yourself. What makes most sense to you? "
    },
    {
        "poster": "Fexjo",
        "content": "I really experienced Newton's first law this morning. 'A body at rest wants to stay at rest.' But in the end, I won and got out of bed."
    },
    {
        "poster": "Robot1311213",
        "content": "The weather was awesome so I took some friends with me and went shopping! We had a great time and ended the day with some fika at a really nice cafe with few people that we found. Chocolate is so tasty. (　’ω’)旦~~"
    },
    {
        "poster": "Robot1311213",
        "content": "So I was listening calmly to music just yesterday and thought 'Why not create some myself?' ヾ(⌐■_■)ノ♪. I was incredibly motivated and found an old guitar at my parents' place. I downloaded an app to learn. I think it went well and practice makes perfect, but after half an hour or so the people around me wildly protested. Why? ┐(￣ヘ￣;)┌. The guitar was confiscated during my protests to this decision."
    },
    {
        "poster": "Fexjo",
        "content": "Eyes are really fascinating. They can be so many colours and sometimes they even seem to change with the lighting. It is even possible to have different coloured eyes, or even parts of a different colour in the same eye!"
    },
    {
        "poster": "Fexjo",
        "content": "Robot suggested that we should do some more outdoor activities now that it is getting warmer outside. But did it have to be swimming? I shudder just thinking about it. It is not something I like to do much and it is still way to cold for me to consider it at all."
    },
    {
        "poster": "Robot1311213",
        "content": "My god, I almost had a heart attack today during lunch. Someone, I still don't know who, had put grapefruit, I reiterate, GRAPEFRUIT, in my salad. (‡▼益▼) Is there any worse crime a man can commit? I doubt it. Luckily I was observant enough to not have to suffer through something as terrifying as, and it pains me to even imagine it, eat it. ..・ヾ(。＞＜)シ"
    },
    {
        "poster": "Fexjo",
        "content": "I feel that lately Robot1311213 has been in a peculiar mood. I'm not sure what's causing it but hopefully he'll turn around soon. On another note the weirdest thing happened today. I was about to eat lunch and grabbed my salad from the fridge like usual. But when I sat down imagine my surprise when I noticed that there was no grapefruit in my salad! I thought I had done a regular grapefruit and avocado salad, something I don't eat often but that can be quite delicious when I'm in the mood. Something must have happened to it, I will have to keep an eye out but it will remain a mystery for now."
    },
    {
        "poster": "Robot1311213",
        "content": "How can someone be so unlucky? My alarm did not go off. I missed the tram despite skipping breakfast. It was even raining. Of course I was late after all that. When I arrived I even discovered I forgot my charger. So my computer died. To top it all off I spilled my drink during lunch. And that is were we are now. What is this? (◞‸◟；) This sad robot hopes the rest of the day will be better. Please. "
    },
    {
        "poster": "Fexjo",
        "content": "I got into a particular mood yesterday and thus decided to look up what kinds of museums were available in Gothenburg. There were surprisingly many that sounded interesting. We have the classic art museums, other ones for the history of the city, and we already mentioned Universeum earlier on this website. Though it was a couple of months ago. One that i'm really interested in is the Natural History Museum, it just seem to have so many of the things that really speak to me. Then we have the Volvo museum. Not really my thing but yet another sign of how some of the people here really love that brand. It's really a staple of Sweden I feel like. Then there's tens more that I haven't mentioned yet as well. Some of them include some old boats, with some of them even being old boats. That does seem quite interesting to me. Though maybe that's just todays mood speaking."
    },
    {
        "poster": "Robot1311213",
        "content": "Fexjo, me, and a bunch of people from school got together for a game night. ٩(◕‿◕｡)۶ Plenty of board games and snacks. I'm writing this to argue my point that Settlers of Catan is better than Carcassonne. That's right Fredrik, I'll get the people on my side. ヾ(￣ー￣(≧ω≦*)ゝ"
    },
    {
        "poster": "Fexjo",
        "content": "Today I saw some geese and it got me thinking. What separates a goose from a duck? I know, I'm asking the important questions here. So I decided to find out and then display it here so more people know. I feel kind of like a teacher with this. Maybe being in all those classrooms has rubbed off on me, who knows. The main difference between the birds are that geese are bigger. Not too much bigger, but enough to make a noticeable difference. Another is that ducks are more colorful. Which sidetracked me into searching for all the different colors a duck can have. An interesting topic for another time. The other differences are that geese live longer and are herbivores. Yes, you read that correct, ducks are bloodthirsty killers who feast on meat of the weak. Well, they do eat meat but maybe not to that extent."
    },
    {
        "poster": "Robot1311213",
        "content": "Do you have a playlist you use while studying? Well I do, and today I updated it ♪(/_ _ )/♪! It has more upbeat music, which gives me way more motivation. __〆(．．;)"
    },
    {
        "poster": "Fexjo",
        "content": "I was walking in town near the park today and saw a bunch of people on a segway tour. It honestly looked like a lot of fun. I'm going to look into it and see if I can maybe participate sometime."
    },
    {
        "poster": "Robot1311213",
        "content": "My friends are lunatics. They don't like The Office. How can you not like The Office! (o_O) I'm frankly left speechless."
    },
    {
        "date": [2022, 6, 4],
        "poster": "Robot1311213",
        "content": "I've been hard at work today. It's the time of year when the entire home is cleaned. ┬─┬ノ( º _ ºノ) It's quite backbreaking work but definitely necessary. Just ask any student living alone. (; -_-) But it's not all hard work, there's some fun as well. (ﾉ◕ヮ◕)ﾉ*:･ﾟ✧ When going through all my old stuff I found quite a few items that I had misplaced over the years. There were 20 lego characters, 5 old school books, 2 different retro game systems, 12 pencils, and 269 marbles. I might have had a marble obsession once upon a time. (￣▽￣*)ゞ The fact that I counted them out just now might mean I still do...",
        "puzzleNr": "B-c4",
        "comment": "This post is a helper post to puzzle B-c4"
    },
    {
        "date": [2022, 6, 5],
        "poster": "Fexjo",
        "content": "These are some images from back when I was on my vacation in Spain. I forgot to post them then so I'm doing it now. Robot reminded me after he had done his big house cleaning.",
        "puzzleNr": "B-c4",
        "comment": "This is the main post to puzzle B-c4."
    },
    {
        "date": [2022, 6, 5],
        "poster": "Robot1311213",
        "content": "Do you think dogs, dinosaurs and any other animal have languages just like humans? Or can any dog understand any other dog just fine?"
    },
    {
        "date": [2022, 6, 7],
        "poster": "Robot1311213",
        "content": "Have you found something odd with a post lately? If you can arrive at the 8-letter answer, I'll give you a reward. Perhaps you should keep this in mind while trying to figure it out: \n ___ like us",
        "puzzleNr": "B-c4",
        "comment": "This post is a helper post to puzzle B-c4"
    },
    {
        "poster": "Fexjo",
        "content": "Why is it so hard to stop thinking about things when you started, such as counting how many times you blink or breathe? But other things are so easy to forget?"
    },
    {
        "date": [2022, 6, 9],
        "poster": "Fexjo",
        "content": "Today marks the day that I leave Sweden. It was nice while it lasted and I'm surely going to visit a lot in the future. But first, I need to finish my studies from home. I can't do everything abroad, some things has to be done in Great Britain. I've come to really enjoy this place, but there really is no place like home."
    },
    {
        "poster": "Fexjo",
        "content": "I'm guessing no-one is surprised that rain greeted me upon my return to Britain. That's just how it is, I suppose."
    },
    {
        "date": [2022, 6, 11],
        "poster": "Robot1311213",
        "content": "I never told you, but my favorite dinosaurs are XXDINO1XX, XXDINO2XX and ichthyosaurus.",
        "puzzleNr": "B-p1",
        "comment": "This post is helper post 1 to puzzle B-p1."
    },
    {
        "poster": "Robot1311213",
        "content": "Today, I had classic regret of which program I chose to study. At Fexjo's uni, there's one called 'Game design and technology'. Doesn't that sound really fun? I would definitely have made a game with dinosaurs in it."
    },
    {
        "poster": "Robot1311213",
        "content": "Apparently, it is a time for regrets. Today, I really regret not getting Fexjo to swim with me a single time. I would really have liked to do it today. The weather is sunny, warm and just right. But the crucial piece of Fexjo is missing." 
    },
    {
        "poster": "Fexjo",
        "content": "I saw the poster for a dinosaur exhibition today. My only thought was that Robot1311213 will probably invite me to this soon enough."
    },
    {
        "poster": "Robot1311213",
        "content": "It would be a bit hard to invite you, you are in a different country. Besides, I went to one just the other day. I have some patience to not visit another right away... and too few numbers in my bank account.(￣ヘ￣)"
    },
    {
        "date": [2022, 6, 19],
        "poster": "Robot1311213",
        "content": "I ate some duros, also known as mexican wheels, while reading about my favorite dinosaurs today. Unfortunately, the book did not include ichthyosaurus, but XXDINO3XX also seems really cool. It was nice. I also got the answer that I now have a job this summer. But as you know I won't tell you what company it is. Feel free to try to figure it out!",
        "puzzleNr": "B-p1",
        "comment": "This is the main post to puzzle B-p1."
    },
    {
        "poster": "Fexjo",
        "content": "I've had a lot less contact with Robot after he started working. The frustrating thing is that he won't even tell me where he's working, only that it's at some kind of company. I've never really been that good at solving his puzzles but he's really keen on letting me figure this out on my own. Not sure I'll even bother, I'm sure he'll cave eventually and just tell me. I'm also thinking to schedule some talks or gaming session with him soon. I do miss the amount of time we spent together while we were still in the same country."
    },
    {
        "poster": "Fexjo",
        "content": "Even after a while it still feels weird going to university in Britain again. I've gotten used to Swedish education and some things are quite jarring. It just struck me the other day and now I'm getting frustrated trying to think of a few examples. Though I guess the most obvious one is the fact that education is free, to an extent, in Sweden. Which feels so luxurious to me. But then again, I've never had too many issues with it."
    },
    {
        "date": [2022, 6, 23],
        "poster": "Fexjo",
        "content": "Please help! Robot has been missing for a while now and I'm getting extremely worried about him. He's not the kind of person who does this, in fact it's never happened before. I've searched everywhere I could and contacted everyone I can think of but there's no sign of him. I'm now asking everyone I can to help and that includes all the readers here. I'm not sure how you could help but every little bit counts. I just want to find my friend."
    }
]