[
    {
        "date": [2022, 6, 18],
        "poster": "Robot1312113",
        "content": "I ate some duros, also known as mexican wheels, while reading about my favorite dinosaurs today. Unfortunately, the book did not include ichthyosaurus, but XXDINO3XX also seems really cool. It was nice. I also got the answer that I now have a job this summer. But as you know I won't tell you what company it is. Feel free to try to figure it out!",
        "pictures": [["Puzzles/NumbersPuzzle.png","A numbers puzzle."], ["Puzzles/Ichthyosaurus.png", "A picture of the dinosaur Ichthyosaurus."], ["Puzzles/duros.jpg", "A package of duros."], ["Puzzles/Computer.png", "A computer drinking coffee." ]],
        "isPuzzle": true,
        "puzzleNr": "2c",
        "comment": "This is the main post to puzzle 2c."
    },
    {
        "date": [2022, 6, 19],
        "poster": "Robot1312113",
        "content": "I never told you, but my favorite dinosaurs are XXDINO1XX, XXDINO2XX and ichthyosaurus.",
        "isPuzzle": true,
        "puzzleNr": "2c",
        "comment": "This post is helper post 1 to puzzle 2c."
    },
    {
        "date": [2022, 5, 1],
        "poster": "Robot1312113",
        "content": "Man, this latest course of mine, LMA017, was so fun. Way too little math for my taste though.",
        "isPuzzle": true,
        "puzzleNr": "2c",
        "comment": "This post is helper post 2 to puzzle 2c"
    },
    {
        "date": [2022, 4, 10],
        "poster": "Robot1312113",
        "content": "I borrowed some pictures from Fexjo to make these. What do you think all of it adds up to?",
        "pictures": [["Puzzles/Skyline1.jpg", "A skyline."], ["Puzzles/Skyline2.png", "A skyline"],  ["Puzzles/Skyline3.jpg", "A skyline"], ["Puzzles/Shapes.png", "Two rectangles and a triangle."],  ["Puzzles/Lines.png", "Four underscores in different colours. Three with signs."], ["Puzzles/Signs.png", "Four underscores with minus and then two plus signs between them."] ],
        "isPuzzle": true,
        "puzzleNr": "2b",
        "comment": "This is the main post to puzzle 2b."
    },
    {
        "date": [2022, 1, 7],
        "poster": "Robot1312113",
        "content": "Have you figured out what our usernames mean yet? I'll give you a hint for Fexjo. What is this?",
        "pictures": [["PostImages/Caesar.png", "Some nice salad."]],
        "isPuzzle": true,
        "puzzleNr": "c1",
        "comment": "This puzzle is solved in the chat."
    },
    {
        "date": [2022, 2, 11],
        "poster": "Robot1312113",
        "content": "I composed a poem for everyone today. What do you think? \n \n At pleasant temperature, \n in contrast to how you would like life to be, \n an idea that seems perfect, \n held or fixed in position securely, \n a mistake. \n \n A place where you can buy drinks and simple meals, \n filled with a continuous humming sound, \n a particular variety or type, \n the process of gaining this, \n a victory.",
        "isPuzzle": true,
        "puzzleNr": "c2",
        "comment": "This puzzle is solved in the chat."
    },
    {
        "date": [2022, 1, 5],
        "poster": "Fexjo",
        "content": "Have you read the book 'A Short History of Nearly Everything'? I learned quite a lot of odd things from that. Also, this made me feel quite special: \n \n 'Not one of your pertinent ancestors was squashed, devoured, drowned, starved, stranded, stuck fast, untimely wounded, or otherwise deflected from its life's quest of delivering a tiny charge of genetic material to the right partner at the right moment in order to perpetuate the only possible sequence of hereditary combinations that could result -- eventually, astoundingly, and all too briefly -- in you.' \n \n And this is just way to true: \n \n 'There are three stages in scientific discovery. First, people deny that it is true, then they deny that it is important; finally they credit the wrong person.'",
        "isPuzzle": false
    },
    {
        "poster": "Robot1312113",
        "content": "Have you ever sort of sang in your bad no-one-can-hear-me-so-it-doesn't-matter-voice in the shower only to remember that you have guests? Then you know how I felt today. (－‸ლ)",
        "isPuzzle": false
    },
    {
        "poster": "Robot1312113",
        "content": "Just a happy dinosaur to make your day better.",
        "pictures": [["PostImages/babydino-removebg-preview.png", "Dino!!!"]],
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "Do you ever think about life on other planets? I certainly hope they, on whatever planet they may be, are not as destructive as we are.",
        "isPuzzle": false
    },
    {
        "poster": "Robot1312113",
        "content": "How can someone be so unlucky? My alarm did not go off. I missed the tram despite skipping breakfast. It was even raining. Of course I was late after all that. When I arrived I even discovered I forgot my charger. So my computer died. To top it all off I spilled my drink during lunch. And that is were we are now. What is this? (◞‸◟；) This sad robot hopes the rest of the day will be better. Please. ",
        "isPuzzle": false
    },
    {
        "date": [2022, 3, 14],
        "poster": "Fexjo",
        "content": "I made an assortment of delicious pies today. Included amongst them are apple pies, blueberry pies, rhubarb pies, and a bunch more. It truly was quite a treat.",
        "isPuzzle": false
    },
    {
        "date": [2022, 3, 14],
        "poster": "Robot1312113",
        "content": "I think Fexjo went mad today. Out of nowhere he just suddenly spouted that he needed to make a bunch of pies. He then went on to create an entire buffet. Something has gotten into him, and I'm not quite sure what, or how I can fix him. ＼(〇_ｏ)／",
        "isPuzzle": false
    },
    {
        "date": [2022, 5, 5],
        "poster": "Robot1312113",
        "content": "You ever experienced feeling like you fall and wake up with a start? Today, I also did that. And included the falling part. It hurt. (×_×#)",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "Saw this nice-looking boat today. Somehow, it did not rain although the sky was grey all day.",
        "pictures": [["PostImages/Boat.jpg", "Picture of a boat."]],
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "I watched an old TED talk the other day about the sound of black holes. It was performed by a woman named Janna Levin in 2011 if anyone is interested in attending. To liken a black hole to a drum and to hear the sound and composition of objects existing in a noiseless vacuum, it's truly something I recommend other people take a gander at as well. Revisiting topics like this, even if they're a few years old now, is often an interesting and fascinating experience. Surmise to say, I think i'm going to go through a bunch of old TED talks over the coming week. It just struck me as in the mood.",
        "isPuzzle": false
    },
    {
        "poster": "Robot1312113",
        "content": "My god, I almost had a heart attack today during lunch. Someone, I still don't know who, had put grapefruit, I reiterate, GRAPEFRUIT, in my salad. (‡▼益▼) Is there any worse crime a man can commit? I doubt it. Luckily I was observant enough to not have to suffer through something as terrifying as, and it pains me to even imagine it, eat it. ..・ヾ(。＞＜)シ",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "I feel that lately Robot1312113 has been in a peculiar mood. I'm not sure what's causing it but hopefully he'll turn around soon. On another note the weirdest thing happened today. I was about to eat lunch and grabbed my salad from the fridge like usual. But when I sat down imagine my surprise when I noticed that there was no grapefruit in my salad! I thought I had done a regular grapefruit and avocado salad, something I don't eat often but that can be quite delicious when I'm in the mood. Something must have happened to it, I will have to keep an eye out but it will remain a mystery for now.",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "I figured that we haven't really showed much presence for our school of choice lately and just thought I'd leave this here. To commemorate all the good times we've had.",
        "pictures": [["PostImages/ChalmersLogo.png", "Chalmers logo in gold."]],
        "isPuzzle": false
    },
    {
        "poster": "Robot1312113",
        "content": "You know, one of my friends is working part time as a programmer at a lesser known company. He has developed a routine of multiple cups of coffee a day from the extra hours he works on top of studying. He keeps telling me he is a staunch supporter of python code but I know that his heart lies with java. (￣ω￣)",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "Many trams in Gothenburg have names on them and I have started collecting them. Every time I see a new name, I find out who they are and what they did and add them to my list. Let's see how many I can find before I leave Sweden!",
        "isPuzzle": false
    },
    {
        "poster": "Robot1312113",
        "content": "When people tell me to learn R, they say I should familiarize myself with an entirely new programming language. When they tell a baby to learn R, they just want them to pronounce a letter correctly. Life is unfair. (╥﹏╥)",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "Both our resident robot and I have been feeling a bit cooped up inside for a while. And we haven't really done much together lately. So we decided to take a bit of a walk. Just enjoy the sights and explore parts of the city. Even living in Gothenburg for an entire lifetime will still leave many places unexplored. Not to mention that I've only been here for a year. We saw many beautiful sights on our exploration, though one stuck out to me. We came across this as we were wandering aimlessly along a cycling route. The route is called 'Kattegattsleden' for the avid cyclists that are interested. Apparently it stretches for 390 km, quite a distance to be sure. Back on topic though, the bridge is truly a marvel of engineering. Even I can tell that much without much knowledge in structural architecture. Could do with a paint job but hey, I'm not in charge. ",
        "pictures": [["PostImages/kattegattleden.jpg", "Massive bridge by cycling route."]],
        "isPuzzle": false
    },
    {
        "poster": "Robot1312113",
        "content": "Today, I have a simple query. (⌐■_■) Do you think dinosaurs were hot-blooded or cold-blooded? There are theories pointing toward either case so I would urge you to think about it yourself. What makes most sense to you? ",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "My camera just got smashed after I stumbled and dropped it. Now I'm in the market for a new one. I only have one issue. Cameras are so expensive! It's been so long since I had to buy a new one that I had forgotten the price of quality. I might just have to stick to my guns and go with a cheaper alternative. I'm not made of money after all, especially not for what is, ultimately, just a hobby.",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "I really experienced Newton's first law this morning. 'A body at rest wants to stay at rest.' But in the end, I won and got out of bed.",
        "isPuzzle": false
    },
    {
        "poster": "Robot1312113",
        "content": "So I was listening calmly to music just yesterday and thought 'Why not create some myself?' ヾ(⌐■_■)ノ♪. I was incredibly motivated and found an old guitar at my parents' place. I downloaded an app to learn. I think it went well and pracitce makes perfect, but after half an hour or so the people around me wildly protested. Why? ┐(￣ヘ￣;)┌. The guitar was confiscated during my protests to this decision.",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "Have you heard of the butterfly effect? Where a single flap of a butterfly's wings can cause a tornado in another part of the world. A cascading series of events that causes something huge from the tiniest of things. My teacher did not accept that excuse to why I was late this morning.",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "A common stereotype of students is that they are quite lazy. They come late to class, they don't do all the work assigned to them, and they constantly complain about everything they have to do. Thus, I feel justified in complaining about my latest essay assignment. It feels like I just ran a marathon, and not in a good way. On to better news though, highest grade in class. I'm still amazed with how fast the teacher grades the assignments in this course, I mean, it's barely been three hours. Simply incredible.",
        "isPuzzle": false
    },
    {
        "poster": "Robot1312113",
        "content": "I entered a hacker competition last week and today was finally the day to perform. <(￣︶￣)> Honestly, kind of disappointed in the kind of tests and work we had to do. It's not something I could see being of actual use in a real situation. ┐(￣ヘ￣;)┌ And i'm not just saying that because I lost. (」＞＜)」",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "Today marks the day that I leave Sweden. It was nice while it lasted and I'm surely going to visit a lot in the future. But first, I need to finish my studies from home. I can't do everything abroad, some things has to be done in Great Britain. I've come to really enjoy this place, but there really is no place like home.",
        "isPuzzle": false
    },
    {
        "poster": "Fexjo",
        "content": "I saw the poster for a dinosaur exhibition today. My only thought was that Robot1312113 will probably invite me to this soon enough.",
        "isPuzzle": false
    },
    {
        "poster": "Robot1312113",
        "content": "It would be a bit hard to invite you, you are in a different country. Besides, I went to one just the other day. I have some patience to not visit another right away... and too few numbers in my bank account.(￣ヘ￣)",
        "isPuzzle": false
    }
]